
ruFemNames = ["Августа", "Августина", "Авдотья", "Авелина", "Аврелия", "Аврора", "Агапия", "Агата", "Агафья", "Агафия", "Аглаида", "Аглая", "Агнеса", "Агнесса", "Агния", "Агриппина", "Агрефена", "Ада", "Адель", "Аделия", "Аделаида", "Аза", "Азалия", "Аида", "Акилина", "Акулина", "Аксинья", "Алевтина", "Александра", "Алёна", "Алина", "Алиса", "Алла", "Альбина", "Альвина", "Анастасия", "Анатолия", "Ангелина", "Анжела", "Анимаиса", "Анисия", "Анисья", "Анита", "Анна", "Антонина", "Антонида", "Антония", "Анфиса", "Анфуса", "Анфия", "Ариадна", "Арина", "Аркадия", "Арсения", "Артемия", "Аста", "Астра", "Астрид", "Афанасия", "Афродита", "Аэлита", "Аэлла", "Бажена", "Беата", "Беатриса", "Бела", "Белла", "Берта", "Богдана", "Болеслава", "Борислава", "Бронислава", "Валентина", "Валерия", "Ванда", "Варвара", "Василина", "Василиса", "Васса", "Вацлава", "Вевея", "Венера", "Вера", "Вероника", "Веселина", "Веста", "Видана", "Викторина", "Виктория", "Вилена", "Вилора", "Вилория", "Виола", "Виолетта", "Виоланта", "Виринея", "Виталия", "Виталина", "Влада", "Владилена", "Владимира", "Владислава", "Владлена", "Власта", "Воля", "Всеслава", "Гайя", "Гали", "Галина", "Ганна", "Гаяна", "Гаяния", "Гелена", "Гелия", "Гелла", "Гертруда", "Глафира", "Гликерия", "Глория", "Горислава", "Дайна", "Дана", "Дарья", "Дария", "Дарина", "Дарьяна", "Декабрина", "Дея", "Дия", "Джульетта", "Диана", "Дина", "Диния", "Диодора", "Дионисия", "Добрава", "Домна", "Домина", "Домника", "Доминика", "Донара", "Дорофея", "Доротея", "Ева", "Евгения", "Евдокия", "Евлалия", "Евпраксия", "Евстолия", "Евфалия", "Екатерина", "Елена", "Елизавета", "Еликонида", "Ермиония", "Ефимия", "Евфимия", "Ефросиния", "Евфросиния", "Жанна", "Ждана", "Зара", "Зарема", "Зарина", "Зорина", "Звенислава", "Зинаида", "Зиновия", "Злата", "Зоя", "Иванна", "Ида", "Илария", "Илиана", "Илона", "Инга", "Инесса", "Инна", "Иоанна", "Иона", "Ипатия", "Ипполита", "Ираида", "Ироида", "Ираклия", "Ирина", "Исидора", "Искра", "Ифигения", "Ия", "Калерия", "Калиса", "Капитолина", "Карина", "Каролина", "Катерина", "Кира", "Кирилла", "Клавдия", "Клара", "Клариса", "Кларисса", "Клеопатра", "Конкордия", "Констанция", "Кристина", "Ксения", "Лада", "Лариса", "Лениана", "Ленина", "Леонида", "Леонила", "Леонтия", "Леся", "Ливия", "Лидия", "Лилиана", "Лилия", "Лина", "Лия", "Лея", "Лора", "Луиза", "Лукерия", "Лукиана", "Лукина", "Люцина", "Любава", "Любовь", "Любомира", "Людмила", "Мавра", "Магда", "Магдалина", "Мадлен", "Майя", "Мая", "Мальвина", "Маргарита", "Мариана", "Марьяна", "Марианна", "Мариетта", "Мариэтта", "Марина", "Мария", "Марья", "Мари", "Марлена", "Марта", "Марфа", "Матильда", "Матрёна", "Матрона", "Мелания", "Меланья", "Мелитина", "Милада", "Милана", "Милена", "Милица", "Милия", "Милослава", "Мира", "Мирра", "Мирослава", "Митродора", "Млада", "Мстислава", "Муза", "Нада", "Надежда", "Надия", "Наина", "Нана", "Настасья", "Наталья", "Наталия", "Нелли", "Неонила", "Ника", "Нина", "Нинелла", "Нинель", "Новелла", "Нонна", "Оксана", "Октавия", "Октябрина", "Олеся", "Оливия", "Олимпиада", "Олимпия", "Ольга", "Павла", "Павлина", "Пелагея", "Платонида", "Поликсена", "Полина", "Правдина", "Нора", "Прасковья", "Рада", "Радмила", "Раиса", "Раймонда", "Ревмира", "Регина", "Рената", "Римма", "Рогнеда", "Роза", "Розалия", "Розана", "Ростислава", "Руслана", "Руфина", "Руфь", "Сабина", "Савина", "Саломея", "Соломея", "Светлана", "Светозара", "Светослава", "Свобода", "Святослава", "Севастьяна", "Северина", "Селена", "Селина", "Серафима", "Сильва", "Сильвия", "Симона", "Слава", "Славяна", "Снежана", "Софья", "София", "Станислава", "Стелла", "Степанида", "Стефанида", "Стефания", "Сусанна", "Сосанна", "Сюзанна", "Таира", "Таисия", "Тальяна", "Тамара", "Тамила", "Томила", "Татьяна", "Текуса", "Тереза", "Улита", "Ульяна", "Услада", "Устинья", "Фаина", "Февронья", "Феликсана", "Фелицата", "Фелицитата", "Фелиция", "Федора", "Феодора", "Феодосия", "Феодосья", "Феоктиста", "Феофания", "Феона", "Флавия", "Флора", "Флория", "Флорентина", "Флоренция", "Флориана", "Фотина", "Харита", "Харитина", "Хиония", "Христина", "Цецилия", "Чеслава", "Эвелина", "Эвридика", "Эдда", "Элеонора", "Элина", "Эльвира", "Эльмира", "Эльза", "Эмилия", "Эмма", "Эрика", "Эсфирь", "Юдифь", "Юзефа", "Юлиана", "Юлитта", "Юлия", "Юманита", "Юния", "Юнона", "Юстина", "Ядвига", "Яна", "Янина", "Яромира", "Ярослава"].map (x) -> x.toLowerCase()


Capitalize = (s) -> if s then "#{s[0].toUpperCase()}#{s[1..].toLowerCase()}"


exports.inclineFemName = inclineFemName = (name) ->
  name = Capitalize name
  validEndOfWord = ["ч", "щ","ш","ж","ь","и","а","я","ы","ю","е","й","ю","ии","ия","ая","ей","ой","ию","йю","ью"]
  withoutEnd = name[..-2]


  if name.length > 2
    endOfWord = name[-2..]
    if endOfWord in validEndOfWord
      withoutEnd = name[..-3]
    else
      endOfWord = name[-1..]
  else
    endOfWord = name[-1..]

  lastLetter = withoutEnd[-1..]

  if endOfWord == "ь" || ( endOfWord == "ью" && !(withoutEnd[-1..] in "жшчщ"))
    cases = ["#{withoutEnd}ь", "#{withoutEnd}и", "#{withoutEnd}и", "#{withoutEnd}ь", "#{withoutEnd}ью", "#{withoutEnd}и"]
  else if endOfWord == "ью" && withoutEnd[-1..] in "жшчщ"
    cases = ["#{withoutEnd}", "#{withoutEnd}и", "#{withoutEnd}и", "#{withoutEnd}", "#{withoutEnd}ью", "#{withoutEnd}и"]

  else if endOfWord in "жшчщ"
    withoutEnd += endOfWord
    cases = ["#{withoutEnd}", "#{withoutEnd}и", "#{withoutEnd}и", "#{withoutEnd}", "#{withoutEnd}ью", "#{withoutEnd}и"]

  else if endOfWord in "ияюе"
    cases = ["#{withoutEnd}я", "#{withoutEnd}и", "#{withoutEnd}е", "#{withoutEnd}ю", "#{withoutEnd}ей", "#{withoutEnd}е"]
  else if lastLetter in  "жшчщцгкх"
    cases = ["#{withoutEnd}а", "#{withoutEnd}и", "#{withoutEnd}е", "#{withoutEnd}у", "#{withoutEnd}ой", "#{withoutEnd}е"]
  else
    cases = ["#{withoutEnd}а", "#{withoutEnd}ы", "#{withoutEnd}е", "#{withoutEnd}у", "#{withoutEnd}ой", "#{withoutEnd}е"]

  # todo add more exceptions here
  result = name: cases[0], found: cases[0] in ruFemNames, cases: cases, src: name

  result.possible_yes = result.found || endOfWord in validEndOfWord
  caseIndex = cases.indexOf name
  result.guess_case_index = caseIndex
  result.guess_case = if -1 == caseIndex then "unknown" else ["nominative","genitive","dative","accusative","instrumental","prepositional"][caseIndex]
  result


# lastename = (str) ->
#   ruRe = /^[а-я ]$/i
#   sex = null
#   # try to gess sex
#   inclined = yes

