sys = require "sys"

ruFemNames = ["Августа", "Августина", "Авдотья", "Авелина", "Аврелия", "Аврора", "Агапия", "Агата", "Агафья", "Агафия", "Аглаида", "Аглая", "Агнеса", "Агнесса", "Агния", "Агриппина", "Агрефена", "Ада", "Адель", "Аделия", "Аделаида", "Аза", "Азалия", "Аида", "Акилина", "Акулина", "Аксинья", "Алевтина", "Александра", "Алёна", "Алина", "Алиса", "Алла", "Альбина", "Альвина", "Анастасия", "Анатолия", "Ангелина", "Анжела", "Анимаиса", "Анисия", "Анисья", "Анита", "Анна", "Антонина", "Антонида", "Антония", "Анфиса", "Анфуса", "Анфия", "Ариадна", "Арина", "Аркадия", "Арсения", "Артемия", "Аста", "Астра", "Астрид", "Афанасия", "Афродита", "Аэлита", "Аэлла", "Бажена", "Беата", "Беатриса", "Бела", "Белла", "Берта", "Богдана", "Болеслава", "Борислава", "Бронислава", "Валентина", "Валерия", "Ванда", "Варвара", "Василина", "Василиса", "Васса", "Вацлава", "Вевея", "Венера", "Вера", "Вероника", "Веселина", "Веста", "Видана", "Викторина", "Виктория", "Вилена", "Вилора", "Вилория", "Виола", "Виолетта", "Виоланта", "Виринея", "Виталия", "Виталина", "Влада", "Владилена", "Владимира", "Владислава", "Владлена", "Власта", "Воля", "Всеслава", "Гайя", "Гали", "Галина", "Ганна", "Гаяна", "Гаяния", "Гелена", "Гелия", "Гелла", "Гертруда", "Глафира", "Гликерия", "Глория", "Горислава", "Дайна", "Дана", "Дарья", "Дария", "Дарина", "Дарьяна", "Декабрина", "Дея", "Дия", "Джульетта", "Диана", "Дина", "Диния", "Диодора", "Дионисия", "Добрава", "Домна", "Домина", "Домника", "Доминика", "Донара", "Дорофея", "Доротея", "Ева", "Евгения", "Евдокия", "Евлалия", "Евпраксия", "Евстолия", "Евфалия", "Екатерина", "Елена", "Елизавета", "Еликонида", "Ермиония", "Ефимия", "Евфимия", "Ефросиния", "Евфросиния", "Жанна", "Ждана", "Зара", "Зарема", "Зарина", "Зорина", "Звенислава", "Зинаида", "Зиновия", "Злата", "Зоя", "Иванна", "Ида", "Илария", "Илиана", "Илона", "Инга", "Инесса", "Инна", "Иоанна", "Иона", "Ипатия", "Ипполита", "Ираида", "Ироида", "Ираклия", "Ирина", "Исидора", "Искра", "Ифигения", "Ия", "Калерия", "Калиса", "Капитолина", "Карина", "Каролина", "Катерина", "Кира", "Кирилла", "Клавдия", "Клара", "Клариса", "Кларисса", "Клеопатра", "Конкордия", "Констанция", "Кристина", "Ксения", "Лада", "Лариса", "Лениана", "Ленина", "Леонида", "Леонила", "Леонтия", "Леся", "Ливия", "Лидия", "Лилиана", "Лилия", "Лина", "Лия", "Лея", "Лора", "Луиза", "Лукерия", "Лукиана", "Лукина", "Люцина", "Любава", "Любовь", "Любомира", "Людмила", "Мавра", "Магда", "Магдалина", "Мадлен", "Майя", "Мая", "Мальвина", "Маргарита", "Мариана", "Марьяна", "Марианна", "Мариетта", "Мариэтта", "Марина", "Мария", "Марья", "Мари", "Марлена", "Марта", "Марфа", "Матильда", "Матрёна", "Матрона", "Мелания", "Меланья", "Мелитина", "Милада", "Милана", "Милена", "Милица", "Милия", "Милослава", "Мира", "Мирра", "Мирослава", "Митродора", "Млада", "Мстислава", "Муза", "Нада", "Надежда", "Надия", "Наина", "Нана", "Настасья", "Наталья", "Наталия", "Нелли", "Неонила", "Ника", "Нина", "Нинелла", "Нинель", "Новелла", "Нонна", "Оксана", "Октавия", "Октябрина", "Олеся", "Оливия", "Олимпиада", "Олимпия", "Ольга", "Павла", "Павлина", "Пелагея", "Платонида", "Поликсена", "Полина", "Правдина", "Нора", "Прасковья", "Рада", "Радмила", "Раиса", "Раймонда", "Ревмира", "Регина", "Рената", "Римма", "Рогнеда", "Роза", "Розалия", "Розана", "Ростислава", "Руслана", "Руфина", "Руфь", "Сабина", "Савина", "Саломея", "Соломея", "Светлана", "Светозара", "Светослава", "Свобода", "Святослава", "Севастьяна", "Северина", "Селена", "Селина", "Серафима", "Сильва", "Сильвия", "Симона", "Слава", "Славяна", "Снежана", "Софья", "София", "Станислава", "Стелла", "Степанида", "Стефанида", "Стефания", "Сусанна", "Сосанна", "Сюзанна", "Таира", "Таисия", "Тальяна", "Тамара", "Тамила", "Томила", "Татьяна", "Текуса", "Тереза", "Улита", "Ульяна", "Услада", "Устинья", "Фаина", "Февронья", "Феликсана", "Фелицата", "Фелицитата", "Фелиция", "Федора", "Феодора", "Феодосия", "Феодосья", "Феоктиста", "Феофания", "Феона", "Флавия", "Флора", "Флория", "Флорентина", "Флоренция", "Флориана", "Фотина", "Харита", "Харитина", "Хиония", "Христина", "Цецилия", "Чеслава", "Эвелина", "Эвридика", "Эдда", "Элеонора", "Элина", "Эльвира", "Эльмира", "Эльза", "Эмилия", "Эмма", "Эрика", "Эсфирь", "Юдифь", "Юзефа", "Юлиана", "Юлитта", "Юлия", "Юманита", "Юния", "Юнона", "Юстина", "Ядвига", "Яна", "Янина", "Яромира", "Ярослава"].map (x) -> x.toLowerCase()

ruMaleNames = ["Абрам", "Август", "Авдей", "Адам", "Адольф", "Адриан", "Аким", "Александр", "Алексей", "Альберт", "Альфред", "Анатолий", "Андрей", "Аникита", "Антон", "Ануфрий", "Арам", "Арий", "Аристарх", "Аркадий", "Арнольд", "Арон", "Арсен", "Артем", "Артемий", "Артур", "Аскольд", "Афанасий", "Ахмет", "Ашот","Бенедикт", "Бернар", "Богдан", "Болеслав", "Бонифаций", "Борис", "Борислав", "Бронислав","Вадим", "Валентин", "Валерий", "Вальтер", "Василий", "Велор", "Венедикт", "Вениамин", "Виктор", "Вилли", "Вильгельм", "Виссарион", "Виталий", "Владимир", "Владислав", "Вольдемар", "Всеволод", "Вячеслав","Гавриил", "Гарри", "Геннадий", "Генрих", "Георгий", "Геральд", "Герасим", "Герман", "Глеб", "Гордей", "Градимир", "Григорий", "Гурий","Давыд", "Даниил", "Демид", "Демьян", "Денис", "Дмитрий", "Донат", "Дорофей","Евгений", "Евдоким", "Евстафий", "Егор", "Елисей", "Емельян", "Ермолай", "Ерофей", "Ефим", "Ефрем","Жорж","Захар", "Зигмунд", "Зиновий","Ибрагим", "Иван", "Игнат", "Игорь", "Измаил", "Израиль", "Илларион", "Илья", "Иннокентий", "Ион", "Иосиф", "Ираклий", "Исай","Казимир", "Карен", "Карл", "Кирилл", "Клавдий", "Клемент", "Клим", "Кондрат", "Конкордий", "Константин", "Кузьма","Лазарь", "Лев", "Леван", "Леонард", "Леонид", "Леонтий", "Леопольд", "Лука", "Любомир", "Людвиг","Май", "Макар", "Максим", "Максимилиан", "Марат", "Мариан", "Марк", "Мартин", "Матвей", "Мераб", "Мечеслав", "Мирон", "Мирослав", "Михаил", "Модест", "Моисей", "Мурат","Назар", "Натан", "Наум", "Никита", "Никифор", "Николай", "Никон", "Нисон", "Нифонт","Олег", "Олесь", "Онисим", "Орест", "Осип", "Оскар","Павел", "Парамон", "Петр", "Платон", "Прохор","Равиль", "Радий", "Рафик", "Рашид", "Ринат", "Ричард", "Роберт", "Родион", "Ролан", "Роман", "Ростислав", "Рубен", "Рудольф", "Руслан", "Рустам","Савва", "Савел", "Самсон", "Святослав", "Севастьян", "Семен", "Серафим", "Сергей", "Соломон", "Спартак", "Станислав", "Степан", "Стоян","Тамаз", "Тарас", "Теодор" , "Терентий", "Тигран", "Тимофей", "Тимур", "Тит", "Тихон", "Трифон", "Трофим","Устин","Федор", "Феликс", "Феодосий", "Филимон", "Филипп", "Фома", "Фридрих","Харитон", "Христиан", "Христофор","Эдуард", "Эльдар", "Эмиль", "Эммануил", "Эрик", "Эрнест","Юлиан", "Юрий","Яким", "Яков", "Ян", "Ярослав"].map (x) -> x.toLowerCase()

ruMaleNamesDict = { "ааран": 1, "аарен": 1, "ааррон": 1, "аб": 1, "аббат": 1, "абботт": 1, "абей": 1, "абелл": 1, "абель": 1, "абнар": 1, "абнер": 1, "абнор": 1, "абот": 1, "аботт": 1, "абрам": 1, "абран": 1, "абрахам": 1, "абсалон": 1, "авангард": 1, "август": 1, "августин": 1, "авдей": 1, "авдий": 1, "авенир": 1, "аверилл": 1, "аверкий": 1, "авксентий": 1, "аврам": 1, "аврор": 1, "аврорий": 1, "агап": 1, "аггей": 1, "агей": 1, "адам": 1, "аддам": 1, "аддисон": 1, "аден": 1, "адий": 1, "адисон": 1, "адиссон": 1, "адлэй": 1, "адней": 1, "адольф": 1, "адонис": 1, "адриан": 1, "адэйр": 1, "адэр": 1, "азия": 1, "азэлстан": 1, "айбл": 1, "айзек": 1, "айк": 1, "ак": 1, "акей": 1, "акерлеа": 1, "акерлей": 1, "акерли": 1, "аки": 1, "аким": 1, "аклеа": 1, "аклей": 1, "акли": 1, "аксён": 1, "актон": 1, "акэль": 1, "алан": 1, "аластеир": 1, "аластэйр": 1, "алвар": 1, "алвен": 1, "алви": 1, "алвин": 1, "алвис": 1, "алгар": 1, "алджернон": 1, "алевтин": 1, "алеистер": 1, "алек": 1, "алекс": 1, "александр": 1, "алексей": 1, "ален": 1, "алестер": 1, "алжир": 1, "алик": 1, "аликс": 1, "алим": 1, "алисандр": 1, "алисдэйр": 1, "алиссандр": 1, "алистер": 1, "алистэйр": 1, "аллан": 1, "аллен": 1, "аллин": 1, "аллистер": 1, "аллистир": 1, "аллистэйр": 1, "алтон": 1, "алф": 1, "алфонзо": 1, "алфорд": 1, "алфрид": 1, "альберт": 1, "альбин": 1, "альвиан": 1, "альвин": 1, "альдина": 1, "альпин": 1, "альтаир": 1, "альфа": 1, "альфи": 1, "альфред": 1, "алэйстер": 1, "алэйстэйр": 1, "амби": 1, "амброуз": 1, "амедеус": 1, "амиас": 1, "амори": 1, "амос": 1, "амьяс": 1, "анакин": 1, "ананий": 1, "анастасий": 1, "анатолий": 1, "анвар": 1, "ангел": 1, "ангес": 1, "андерсон": 1, "анджелл": 1, "андрей": 1, "андреян": 1, "андриан": 1, "андрон": 1, "анж": 1, "анис": 1, "анисий": 1, "анисим": 1, "анри": 1, "анском": 1, "анскомб": 1, "ансон": 1, "антван": 1, "антип": 1, "антон": 1, "антоний": 1, "антонин": 1, "антуан": 1, "аполлинарий": 1, "аполлон": 1, "арам": 1, "арвид": 1, "аргент": 1, "арден": 1, "арефий": 1, "арий": 1, "арик": 1, "арил": 1, "арин": 1, "аристарх": 1, "аркадий": 1, "аркелл": 1, "арлен": 1, "арли": 1, "арман": 1, "арн": 1, "арне": 1, "арни": 1, "арнольд": 1, "арран": 1, "аррин": 1, "аррон": 1, "арсен": 1, "арсений": 1, "арт": 1, "артамон": 1, "артемий": 1, "арти": 1, "артур": 1, "артём": 1, "архип": 1, "арчи": 1, "арчибальд": 1, "аселет": 1, "аселин": 1, "асер": 1, "аскольд": 1, "астон": 1, "атеист": 1, "афанасий": 1, "афиноген": 1, "афтон": 1, "аффтон": 1, "ахмат": 1, "ахмет": 1, "ачилл": 1, "аш": 1, "ашер": 1, "ашот": 1, "аштон": 1, "баграт": 1, "бад": 1, "бадди": 1, "бажен": 1, "баз": 1, "базилик": 1, "байрон": 1, "байярд": 1, "бак": 1, "бакстер": 1, "балдер": 1, "балдрик": 1, "бамби": 1, "баптист": 1, "бардолф": 1, "барии": 1, "барклей": 1, "барнабас": 1, "барни": 1, "барнэби": 1, "барретт": 1, "барри": 1, "барт": 1, "бартоломей": 1, "бассетт": 1, "бастер": 1, "бастиан": 1, "батч": 1, "баян": 1, "беван": 1, "беверли": 1, "бевис": 1, "бедивир": 1, "бейб": 1, "бейлей": 1, "бейлие": 1, "бен": 1, "бенджамин": 1, "бенджи": 1, "бенедикт": 1, "бенет": 1, "беннетт": 1, "бенни": 1, "бенние": 1, "бенсон": 1, "бентлей": 1, "бентон": 1, "беорегард": 1, "бердт": 1, "беренгар": 1, "беренджер": 1, "берет": 1, "бернард": 1, "берни": 1, "берри": 1, "берт": 1, "берти": 1, "бертольд": 1, "бертон": 1, "бертрам": 1, "бертран": 1, "бивис": 1, "билл": 1, "билли": 1, "бисш": 1, "биф": 1, "блейн": 1, "близэ": 1, "блисс": 1, "блэйз": 1, "блэйк": 1, "блэйн": 1, "блэр": 1, "боб": 1, "бобби": 1, "богдан": 1, "боеслав": 1, "болдуин": 1, "болеслав": 1, "боллард": 1, "бомонт": 1, "бонифэйс": 1, "боримир": 1, "борис": 1, "борислав": 1, "боян": 1, "брадлей": 1, "браеден": 1, "брайен": 1, "брайон": 1, "бранден": 1, "брандон": 1, "браннон": 1, "брейден": 1, "брейдн": 1, "брендан": 1, "бренден": 1, "брендон": 1, "бреннан": 1, "брент": 1, "брентон": 1, "брет": 1, "бретт": 1, "бриар": 1, "брион": 1, "брис": 1, "бриско": 1, "бриттон": 1, "бриэм": 1, "бродерик": 1, "броди": 1, "броз": 1, "брок": 1, "бронислав": 1, "бронт": 1, "броуди": 1, "броук": 1, "брук": 1, "брукс": 1, "бруно": 1, "брутус": 1, "брьянт": 1, "брэд": 1, "брэди": 1, "брэдфорд": 1, "брэйден": 1, "брэйди": 1, "брэм": 1, "брэн": 1, "брюс": 1, "брююс": 1, "будимир": 1, "буз": 1, "букер": 1, "булат": 1, "бью": 1, "бэйли": 1, "вавила": 1, "вадим": 1, "вал": 1, "валентайн": 1, "валентин": 1, "валериан": 1, "валерий": 1, "валерьян": 1, "вальдемар": 1, "вальтер": 1, "ванадий": 1, "вард": 1, "варлаам": 1, "варлам": 1, "варлен": 1, "вартан": 1, "варфоломей": 1, "василий": 1, "василько": 1, "ваухан": 1, "вахтанг": 1, "вацлав": 1, "вашингтон": 1, "вебстер": 1, "велдон": 1, "велимир": 1, "велислав": 1, "велор": 1, "велорий": 1, "венедикт": 1, "вениамин": 1, "вер": 1, "вергилий": 1, "верджил": 1, "верн": 1, "вернон": 1, "вестер": 1, "вестлей": 1, "вестон": 1, "вик": 1, "викентий": 1, "виктор": 1, "вил": 1, "вилберн": 1, "вилей": 1, "вилен": 1, "вилий": 1, "вилиор": 1, "вилки": 1, "вилл": 1, "вилли": 1, "виллоби": 1, "вилмар": 1, "вилмер": 1, "вилмот": 1, "вилор": 1, "вилорг": 1, "вилорий": 1, "вилсон": 1, "вилф": 1, "вилфорд": 1, "виль": 1, "вильгельм": 1, "вильтон": 1, "вильям": 1, "вин": 1, "виндзор": 1, "винни": 1, "винс": 1, "винсент": 1, "винслоу": 1, "винтроп": 1, "винцент": 1, "виолен": 1, "вирджиль": 1, "виссарион": 1, "вистан": 1, "виталий": 1, "витейкр": 1, "витней": 1, "витольд": 1, "влад": 1, "владелин": 1, "владилен": 1, "владимир": 1, "владислав": 1, "владлен": 1, "влас": 1, "власий": 1, "воган": 1, "вогн": 1, "воин": 1, "воислав": 1, "волдо": 1, "волемир": 1, "волкер": 1, "воллис": 1, "володар": 1, "вольдемар": 1, "вольмир": 1, "вольт": 1, "вольф": 1, "вольфрам": 1, "воспой": 1, "всеволод": 1, "всемил": 1, "вуди": 1, "вудроу": 1, "вулф": 1, "вьятт": 1, "вэйд": 1, "вэйланд": 1, "вэнс": 1, "вячеслав": 1, "габби": 1, "габриель": 1, "габриэль": 1, "гавриил": 1, "гаврил": 1, "гаврила": 1, "гаврило": 1, "гай": 1, "гайдар": 1, "гайлс": 1, "галактион": 1, "гален": 1, "галий": 1, "гамильтон": 1, "гамлет": 1, "гантэр": 1, "гаральд": 1, "гарван": 1, "гарей": 1, "гарибальди": 1, "гарланд": 1, "гарнет": 1, "гарольд": 1, "гарри": 1, "гаррий": 1, "гарс": 1, "гарфилд": 1, "гас": 1, "гаспар": 1, "гваделупа": 1, "гвидон": 1, "гейб": 1, "гейл": 1, "гейр": 1, "гектор": 1, "гелеон": 1, "гелиан": 1, "гелий": 1, "ген": 1, "гений": 1, "геннадий": 1, "генри": 1, "генрих": 1, "геодар": 1, "георгий": 1, "геральд": 1, "герасим": 1, "герберт": 1, "герман": 1, "гермоген": 1, "герольд": 1, "геронт": 1, "геронтий": 1, "герт": 1, "гертруд": 1, "гидеон": 1, "гильберт": 1, "гисберт": 1, "гладвин": 1, "гланвилл": 1, "глеб": 1, "глендауэр": 1, "гленн": 1, "глэн": 1, "говард": 1, "годвин": 1, "годфри": 1, "голлагэр": 1, "голладжер": 1, "гомер": 1, "горазд": 1, "гораций": 1, "горд": 1, "гордей": 1, "горден": 1, "гордий": 1, "гордон": 1, "горимир": 1, "горислав": 1, "горн": 1, "граем": 1, "грай": 1, "гранвилл": 1, "гранд": 1, "гранит": 1, "грахэйм": 1, "грег": 1, "грей": 1, "гренвилл": 1, "григорий": 1, "гриир": 1, "грир": 1, "гриффин": 1, "гриффит": 1, "гровер": 1, "грэг": 1, "грэгори": 1, "грэди": 1, "грэм": 1, "гудвин": 1, "гудзон": 1, "гурий": 1, "густав": 1, "гэй": 1, "гэйбл": 1, "гэйг": 1, "гэйдж": 1, "гэйелорд": 1, "гэйл": 1, "гэйлон": 1, "гэйлорд": 1, "гэйр": 1, "гэлл": 1, "гэри": 1, "давей": 1, "дави": 1, "давид": 1, "давыд": 1, "дад": 1, "дадда": 1, "дадли": 1, "даймонд": 1, "дакей": 1, "дакота": 1, "дакс": 1, "далтон": 1, "дамайон": 1, "дамиан": 1, "дамир": 1, "дан": 1, "дана": 1, "дани": 1, "даниар": 1, "даниил": 1, "данил": 1, "данила": 1, "данило": 1, "даниэль": 1, "данки": 1, "данни": 1, "дар": 1, "дарби": 1, "дарвин": 1, "дарден": 1, "дарен": 1, "дариан": 1, "дарил": 1, "дарин": 1, "дарки": 1, "дарнелл": 1, "даррел": 1, "даррен": 1, "даррил": 1, "даррин": 1, "даррэль": 1, "дасти": 1, "дастин": 1, "дау": 1, "дафф": 1, "даффи": 1, "дашилл": 1, "дван": 1, "двэйн": 1, "деай": 1, "деван": 1, "девен": 1, "девереукс": 1, "девин": 1, "девон": 1, "дейв": 1, "дейл": 1, "дейрлл": 1, "дейрн": 1, "декабрий": 1, "деклан": 1, "декстер": 1, "делберт": 1, "делл": 1, "делмар": 1, "делрой": 1, "дементий": 1, "деметриус": 1, "демид": 1, "демократ": 1, "демон": 1, "демьян": 1, "ден": 1, "денвер": 1, "денеб": 1, "дензэль": 1, "дени": 1, "денил": 1, "денис": 1, "деннис": 1, "дентон": 1, "деон": 1, "деонн": 1, "деонт": 1, "дерби": 1, "дерек": 1, "дерик": 1, "дермот": 1, "дерок": 1, "деррен": 1, "дерри": 1, "деррил": 1, "дефорест": 1, "дефоррест": 1, "дешон": 1, "джадд": 1, "джадин": 1, "джай": 1, "джайлс": 1, "джак": 1, "джамар": 1, "джамей": 1, "джамисон": 1, "джарвис": 1, "джаред": 1, "джарод": 1, "джарред": 1, "джарретт": 1, "джаррод": 1, "джаспер": 1, "джасти": 1, "джастин": 1, "джеб": 1, "джед": 1, "джедидиа": 1, "джейдн": 1, "джейк": 1, "джейлн": 1, "джейми": 1, "джеймс": 1, "джейрт": 1, "джейсон": 1, "джекки": 1, "джекоб": 1, "джем": 1, "дженкин": 1, "джеп": 1, "джер": 1, "джералд": 1, "джеральд": 1, "джерард": 1, "джерваз": 1, "джервис": 1, "джереми": 1, "джери": 1, "джермэйн": 1, "джеролд": 1, "джером": 1, "джеррард": 1, "джерред": 1, "джерри": 1, "джеррод": 1, "джерролд": 1, "джес": 1, "джесси": 1, "джетро": 1, "джетт": 1, "джеф": 1, "джеффери": 1, "джефферсон": 1, "джеффрей": 1, "джеффри": 1, "джиб": 1, "джид": 1, "джиди": 1, "джил": 1, "джим": 1, "джими": 1, "джимми": 1, "джисберт": 1, "джиффард": 1, "джо": 1, "джоб": 1, "джоби": 1, "джоджо": 1, "джоди": 1, "джозеф": 1, "джой": 1, "джойс": 1, "джон": 1, "джоназан": 1, "джоназон": 1, "джонасон": 1, "джонатан": 1, "джоней": 1, "джони": 1, "джонни": 1, "джонти": 1, "джорги": 1, "джордан": 1, "джордж": 1, "джорди": 1, "джордон": 1, "джосс": 1, "джоул": 1, "джош": 1, "джошоа": 1, "джошуа": 1, "джулс": 1, "джульян": 1, "джустис": 1, "джьюд": 1, "джэй": 1, "джэйд": 1, "джэйда": 1, "джэйден": 1, "джэйдон": 1, "джэйкоб": 1, "джэйлен": 1, "джэйлин": 1, "джэйлон": 1, "джэймес": 1, "джэйсон": 1, "джэксон": 1, "джэмини": 1, "джэмми": 1, "джэн": 1, "ди": 1, "диакон": 1, "дигби": 1, "диггори": 1, "дигори": 1, "дидим": 1, "дизон": 1, "дик": 1, "дики": 1, "дикки": 1, "дил": 1, "дилан": 1, "дилберт": 1, "димер": 1, "димитрий": 1, "дин": 1, "диндр": 1, "дионис": 1, "дионисий": 1, "дирк": 1, "дмитрий": 1, "доб": 1, "добрыня": 1, "додж": 1, "дольф": 1, "дом": 1, "доменик": 1, "доминик": 1, "дон": 1, "дональд": 1, "дональт": 1, "донат": 1, "донни": 1, "донован": 1, "дор": 1, "дориан": 1, "дорофей": 1, "доусон": 1, "драйк": 1, "древ": 1, "дрейвн": 1, "дуайт": 1, "дуан": 1, "дуг": 1, "дуги": 1, "дуглас": 1, "дункан": 1, "дунстан": 1, "дью": 1, "дьюей": 1, "дьюэйн": 1, "дэвид": 1, "дэвис": 1, "дэй": 1, "дэйви": 1, "дэйн": 1, "дэйтон": 1, "дэн": 1, "дэни": 1, "дэниел": 1, "дэнни": 1, "дэррик": 1, "дэшон": 1, "дюк": 1, "евгений": 1, "евграф": 1, "евдоким": 1, "евлампий": 1, "евлогий": 1, "евсей": 1, "евстафий": 1, "егор": 1, "елеазар": 1, "елизар": 1, "елисей": 1, "емельян": 1, "епифан": 1, "еремей": 1, "ермак": 1, "ермил": 1, "ермолай": 1, "ерофей": 1, "еруслан": 1, "ефим": 1, "ефрем": 1, "ждан": 1, "жерар": 1, "жозеф": 1, "жорес": 1, "жюль": 1, "завир": 1, "зак": 1, "закери": 1, "зандер": 1, "захар": 1, "захарий": 1, "зачариа": 1, "зачэри": 1, "зед": 1, "зедекиа": 1, "зек": 1, "зигмунд": 1, "зигфрид": 1, "зиновий": 1, "зорий": 1, "зосим": 1, "зосима": 1, "зот": 1, "зубин": 1, "зэофилус": 1, "иб": 1, "ибрагим": 1, "иван": 1, "игнат": 1, "игнатий": 1, "игнатиус": 1, "игорь": 1, "ид": 1, "иероним": 1, "иззи": 1, "изидор": 1, "измаил": 1, "измайло": 1, "изяслав": 1, "ий": 1, "икар": 1, "илар": 1, "иларий": 1, "иларион": 1, "илий": 1, "илиодор": 1, "илларион": 1, "илья": 1, "имон": 1, "инглеберт": 1, "инграм": 1, "инди": 1, "индиана": 1, "индиго": 1, "инесент": 1, "иниго": 1, "иннокентий": 1, "иоанн": 1, "иорик": 1, "иосиф": 1, "ипат": 1, "ипатий": 1, "ипполит": 1, "ираклий": 1, "ирвайн": 1, "ирвин": 1, "ирвинг": 1, "ириней": 1, "ириний": 1, "ирл": 1, "ирм": 1, "ирнест": 1, "исай": 1, "исайя": 1, "исак": 1, "исакий": 1, "исей": 1, "исидор": 1, "иссак": 1, "исси": 1, "истер": 1, "июлий": 1, "йорк": 1, "ка": 1, "кадмус": 1, "казимир": 1, "каин": 1, "каир": 1, "кайд": 1, "кайл": 1, "кал": 1, "калин": 1, "калина": 1, "каллен": 1, "кам": 1, "камден": 1, "камиль": 1, "камрон": 1, "капитон": 1, "карбрей": 1, "карбри": 1, "карвер": 1, "карей": 1, "карен": 1, "карл": 1, "карлайл": 1, "карлейл": 1, "карлин": 1, "карлтон": 1, "карм": 1, "кармий": 1, "карп": 1, "каррол": 1, "картер": 1, "касиди": 1, "каспар": 1, "каспер": 1, "кассиди": 1, "касьян": 1, "квентин": 1, "квинтин": 1, "кеван": 1, "кевин": 1, "кей": 1, "кейденс": 1, "кейдн": 1, "кейлб": 1, "кеймрон": 1, "кейси": 1, "келвин": 1, "келкей": 1, "келл": 1, "келли": 1, "келсей": 1, "кемп": 1, "кен": 1, "кендал": 1, "кендол": 1, "кендрик": 1, "кенелм": 1, "кензи": 1, "кенит": 1, "кеннеди": 1, "кеннет": 1, "кенни": 1, "кеннит": 1, "кенрик": 1, "кент": 1, "кентиджерн": 1, "кентон": 1, "кермит": 1, "керней": 1, "керр": 1, "керри": 1, "керт": 1, "кертис": 1, "кешон": 1, "ки": 1, "киаран": 1, "килан": 1, "килер": 1, "килиан": 1, "киллиан": 1, "ким": 1, "кимбелайн": 1, "кимберли": 1, "кимбол": 1, "кимбэль": 1, "кин": 1, "кинан": 1, "кинастон": 1, "кинг": 1, "кингслей": 1, "кип": 1, "киприан": 1, "кир": 1, "киран": 1, "кирби": 1, "кирилл": 1, "кирк": 1, "кирон": 1, "кирус": 1, "кит": 1, "китон": 1, "киф": 1, "клавдий": 1, "клайв": 1, "клайд": 1, "кланкей": 1, "кланки": 1, "кларенс": 1, "кларк": 1, "клев": 1, "клей": 1, "клейтон": 1, "клем": 1, "клемент": 1, "клементий": 1, "клемми": 1, "клетис": 1, "клетус": 1, "кливленд": 1, "клим": 1, "климент": 1, "климентий": 1, "клинт": 1, "клинтон": 1, "клифтон": 1, "клифф": 1, "клиффорд": 1, "клод": 1, "клэйрк": 1, "клэр": 1, "кодей": 1, "коди": 1, "коертней": 1, "козьма": 1, "кола": 1, "коламбан": 1, "колберт": 1, "колби": 1, "колдер": 1, "колин": 1, "коллахан": 1, "коллин": 1, "коллум": 1, "колтен": 1, "колтон": 1, "колумбий": 1, "кольт": 1, "конан": 1, "конвей": 1, "кондрат": 1, "кондратий": 1, "конлей": 1, "коннелл": 1, "коннер": 1, "коннор": 1, "конон": 1, "конор": 1, "конрад": 1, "константин": 1, "конфуций": 1, "корбин": 1, "корделл": 1, "корей": 1, "кори": 1, "корней": 1, "корнелий": 1, "корнелиус": 1, "корнил": 1, "кортней": 1, "кортни": 1, "корэй": 1, "коти": 1, "коул": 1, "коулман": 1, "краснослав": 1, "крис": 1, "криспиан": 1, "криспин": 1, "кристи": 1, "кристиан": 1, "кристопэр": 1, "кристоф": 1, "кристофер": 1, "крофорд": 1, "крофтон": 1, "крэйг": 1, "ксавайор": 1, "ксавьер": 1, "ксан": 1, "ксенофонт": 1, "ксзавир": 1, "кузьма": 1, "куин": 1, "куинкей": 1, "куинси": 1, "куинтон": 1, "купер": 1, "куприян": 1, "курт": 1, "куртис": 1, "кэйд": 1, "кэйдн": 1, "кэйл": 1, "кэйлб": 1, "кэймрон": 1, "кэйн": 1, "кэйси": 1, "кэлвин": 1, "кэм": 1, "кэмп": 1, "кэмпбэл": 1, "кэри": 1, "кюри": 1, "лаверн": 1, "лавлл": 1, "лавр": 1, "лаврентий": 1, "лаз": 1, "лазарь": 1, "лайл": 1, "лайонел": 1, "лаки": 1, "ланни": 1, "ланфорд": 1, "ларион": 1, "ларк": 1, "ларкин": 1, "ларри": 1, "лаэрт": 1, "лев": 1, "леви": 1, "левкий": 1, "лейврн": 1, "лейн": 1, "лейтон": 1, "лекс": 1, "леланд": 1, "лель": 1, "лем": 1, "лемми": 1, "лемюэль": 1, "лен": 1, "ленар": 1, "ленард": 1, "лени": 1, "лениан": 1, "леннард": 1, "ленни": 1, "лео": 1, "леон": 1, "леонард": 1, "леонид": 1, "леонтий": 1, "леопольд": 1, "лермонт": 1, "лерой": 1, "лес": 1, "лесли": 1, "лестер": 1, "ли": 1, "либерт": 1, "ливадий": 1, "лии": 1, "лин": 1, "линдон": 1, "линдсей": 1, "линдси": 1, "линкольн": 1, "линн": 1, "линсей": 1, "линтон": 1, "линус": 1, "линфорд": 1, "лионель": 1, "лир": 1, "лирой": 1, "лисандр": 1, "литон": 1, "лихнис": 1, "ллойд": 1, "ллью": 1, "лльюелин": 1, "лльюеллин": 1, "ло": 1, "ловэль": 1, "лойд": 1, "лон": 1, "лондон": 1, "лонни": 1, "лонс": 1, "лор": 1, "лорен": 1, "лоренс": 1, "лори": 1, "лорин": 1, "лорис": 1, "лорни": 1, "лоррин": 1, "лосон": 1, "лоуэлл": 1, "лоэнгрин": 1, "лу": 1, "лудо": 1, "луи": 1, "лука": 1, "лукиан": 1, "лукьян": 1, "льюин": 1, "льюис": 1, "лэйк": 1, "лэйн": 1, "лэйтон": 1, "лэндон": 1, "лэнс": 1, "лэрри": 1, "любим": 1, "любомир": 1, "людвиг": 1, "людовик": 1, "люк": 1, "люкс": 1, "люксен": 1, "люсьен": 1, "лютер": 1, "люциан": 1, "маверик": 1, "маврикий": 1, "мадисон": 1, "маеслав": 1, "май": 1, "майк": 1, "майкл": 1, "майлз": 1, "майрон": 1, "майслав": 1, "макар": 1, "макарий": 1, "макей": 1, "макензи": 1, "маки": 1, "макинтош": 1, "маккензи": 1, "макс": 1, "максвелл": 1, "максим": 1, "максимилиан": 1, "максимиллиан": 1, "максимильян": 1, "малачи": 1, "малком": 1, "малоун": 1, "манлей": 1, "манни": 1, "манникс": 1, "мануил": 1, "мануйло": 1, "манфред": 1, "марат": 1, "марвин": 1, "мариан": 1, "марин": 1, "мариус": 1, "марк": 1, "марка": 1, "маркел": 1, "маркиан": 1, "марко": 1, "маркус": 1, "марлен": 1, "марлин": 1, "марлон": 1, "марлоу": 1, "мармадьюк": 1, "марри": 1, "марс": 1, "марсен": 1, "марти": 1, "мартиал": 1, "мартин": 1, "мартын": 1, "маршал": 1, "маршалл": 1, "марьян": 1, "масон": 1, "мастерман": 1, "матвей": 1, "матти": 1, "мед": 1, "мелвилль": 1, "мелвин": 1, "мельбурн": 1, "мерв": 1, "мервин": 1, "мерди": 1, "мердо": 1, "мердок": 1, "мередит": 1, "мерит": 1, "меркурий": 1, "мерл": 1, "мерлин": 1, "меррилл": 1, "мерритт": 1, "мертон": 1, "мерфи": 1, "мефодий": 1, "мечеслав": 1, "мечислав": 1, "мид": 1, "миид": 1, "мик": 1, "мика": 1, "мики": 1, "микки": 1, "милад": 1, "милан": 1, "милберн": 1, "милен": 1, "милий": 1, "миллард": 1, "мило": 1, "милонег": 1, "милослав": 1, "милтон": 1, "милфорд": 1, "мир": 1, "мирон": 1, "мирослав": 1, "митчелл": 1, "михаил": 1, "михайло": 1, "мич": 1, "мича": 1, "мичил": 1, "мо": 1, "модест": 1, "моз": 1, "моисей": 1, "молком": 1, "монолит": 1, "монро": 1, "монтагью": 1, "монтгомери": 1, "монте": 1, "монти": 1, "монтморенки": 1, "морган": 1, "морген": 1, "мордекэй": 1, "морис": 1, "морлей": 1, "моррис": 1, "морт": 1, "морти": 1, "мортимер": 1, "мортон": 1, "мосс": 1, "моэ": 1, "мстислав": 1, "мулава": 1, "мурат": 1, "мэйнард": 1, "мэйнерд": 1, "мэйор": 1, "мэйсон": 1, "мэйтланд": 1, "мэлори": 1, "мэль": 1, "мэриан": 1, "мэрион": 1, "мэт": 1, "мэтт": 1, "мэтти": 1, "мэтью": 1, "мюд": 1, "надир": 1, "назаниль": 1, "назар": 1, "назарий": 1, "назим": 1, "найджел": 1, "найлс": 1, "наль": 1, "нанди": 1, "нат": 1, "натан": 1, "наум": 1, "науэлл": 1, "наш": 1, "невада": 1, "неван": 1, "невил": 1, "невилл": 1, "нед": 1, "нейл": 1, "нейлл": 1, "нейт": 1, "нельсон": 1, "нео": 1, "неон": 1, "неонил": 1, "нестер": 1, "нестор": 1, "нивек": 1, "нивен": 1, "ник": 1, "никандр": 1, "никанор": 1, "никита": 1, "никифор": 1, "никк": 1, "никки": 1, "никодим": 1, "никола": 1, "николай": 1, "николас": 1, "никон": 1, "нил": 1, "нили": 1, "нимбус": 1, "нинел": 1, "нинель": 1, "нисон": 1, "нифонт": 1, "ноа": 1, "новомир": 1, "нодар": 1, "ной": 1, "нолан": 1, "нолл": 1, "норберт": 1, "норвуд": 1, "норд": 1, "норм": 1, "норман": 1, "норманд": 1, "норрис": 1, "нортон": 1, "ноубль": 1, "ноэль": 1, "ньют": 1, "ньютон": 1, "оберон": 1, "обин": 1, "обри": 1, "овидий": 1, "огастин": 1, "огден": 1, "огэст": 1, "оделл": 1, "одиссей": 1, "одлей": 1, "одран": 1, "оз": 1, "оззи": 1, "океан": 1, "оксар": 1, "октавиан": 1, "октябрин": 1, "октябрь": 1, "олби": 1, "олбэйн": 1, "олдвен": 1, "олдвин": 1, "олден": 1, "олдин": 1, "олдис": 1, "олдон": 1, "олдос": 1, "олдред": 1, "олдус": 1, "олдфорд": 1, "олег": 1, "олей": 1, "оли": 1, "оливер": 1, "олимпий": 1, "олластер": 1, "олластир": 1, "оллгар": 1, "оллджер": 1, "олли": 1, "оллин": 1, "оллисдэйр": 1, "оллистер": 1, "оллистэйр": 1, "оллон": 1, "оллэйстар": 1, "ольгерд": 1, "омар": 1, "омега": 1, "онисим": 1, "ора": 1, "оран": 1, "орвал": 1, "орвилл": 1, "орест": 1, "ориан": 1, "ормерод": 1, "оррелл": 1, "оррин": 1, "орсон": 1, "осберт": 1, "осбоерн": 1, "осборн": 1, "освальд": 1, "осень": 1, "осип": 1, "оскар": 1, "остап": 1, "остен": 1, "остин": 1, "остромир": 1, "отис": 1, "оттис": 1, "отто": 1, "оттон": 1, "оуин": 1, "оуэн": 1, "ошин": 1, "павел": 1, "пайс": 1, "палладий": 1, "палмер": 1, "панкрас": 1, "пантелей": 1, "пантелеймон": 1, "панфил": 1, "парамон": 1, "паркер": 1, "паррис": 1, "партизан": 1, "пат": 1, "патрик": 1, "патси": 1, "пахом": 1, "пеитон": 1, "пепин": 1, "пересвет": 1, "перри": 1, "перс": 1, "перси": 1, "персиваль": 1, "петеркин": 1, "пимен": 1, "пип": 1, "пипер": 1, "пирр": 1, "пирс": 1, "пит": 1, "питер": 1, "платон": 1, "пол": 1, "поли": 1, "поликарп": 1, "помпей": 1, "портер": 1, "порфирий": 1, "потап": 1, "престон": 1, "приам": 1, "принц": 1, "пров": 1, "прозор": 1, "прокопий": 1, "прокофий": 1, "проспер": 1, "протас": 1, "прохор": 1, "пэйс": 1, "пэйси": 1, "пэйтон": 1, "пётр": 1, "равель": 1, "равен": 1, "равиль": 1, "радамес": 1, "радий": 1, "радим": 1, "радислав": 1, "радомир": 1, "раз": 1, "раймонд": 1, "раймунд": 1, "райордан": 1, "райт": 1, "ралф": 1, "ралфи": 1, "ральф": 1, "ранделл": 1, "ранди": 1, "рандолф": 1, "рандольф": 1, "расс": 1, "рассел": 1, "рассэль": 1, "расти": 1, "растус": 1, "ратмир": 1, "рауль": 1, "рафаил": 1, "рафаэль": 1, "рашид": 1, "раян": 1, "реарден": 1, "ревмир": 1, "реган": 1, "редд": 1, "редж": 1, "реджи": 1, "реджинальд": 1, "редклиф": 1, "редклифф": 1, "редлей": 1, "редманд": 1, "редмонд": 1, "реид": 1, "рей": 1, "рейли": 1, "рейнард": 1, "рейнольд": 1, "рекс": 1, "рем": 1, "ренальд": 1, "ренат": 1, "риган": 1, "ригби": 1, "рид": 1, "ридлей": 1, "риель": 1, "рик": 1, "рикей": 1, "рики": 1, "рилан": 1, "рилей": 1, "рили": 1, "ринат": 1, "рио": 1, "риплей": 1, "рис": 1, "рихард": 1, "рич": 1, "ричард": 1, "ричи": 1, "роальд": 1, "роб": 1, "робби": 1, "роберт": 1, "робеспьер": 1, "роби": 1, "робин": 1, "робинзон": 1, "рован": 1, "род": 1, "роддж": 1, "родджер": 1, "родди": 1, "родерик": 1, "роджер": 1, "родион": 1, "родни": 1, "родолф": 1, "рождеро": 1, "рой": 1, "ройл": 1, "ройс": 1, "ройстон": 1, "роки": 1, "ролан": 1, "роланд": 1, "роли": 1, "ролланд": 1, "ролли": 1, "роман": 1, "ромен": 1, "ромуальд": 1, "рон": 1, "рональд": 1, "ронни": 1, "рори": 1, "роско": 1, "росс": 1, "ростислав": 1, "роуланд": 1, "роулей": 1, "роял": 1, "рубен": 1, "рубин": 1, "руди": 1, "рудольф": 1, "рудьярд": 1, "рунар": 1, "руслан": 1, "руссо": 1, "рустам": 1, "рустем": 1, "рхетт": 1, "рьюб": 1, "рэд": 1, "рэй": 1, "рэйнард": 1, "рэйнер": 1, "рэйф": 1, "рэм": 1, "рэндал": 1, "рэндалл": 1, "рюрик": 1, "сава": 1, "савва": 1, "савелий": 1, "савьер": 1, "сайг": 1, "саймон": 1, "салал": 1, "салливан": 1, "самми": 1, "самойло": 1, "самсон": 1, "самуил": 1, "сандфорд": 1, "санни": 1, "санфорд": 1, "свет": 1, "светлан": 1, "светозар": 1, "светослав": 1, "свизин": 1, "свизун": 1, "свиней": 1, "святогор": 1, "святополк": 1, "святослав": 1, "себастьян": 1, "севард": 1, "севастиан": 1, "севастьян": 1, "север": 1, "севериан": 1, "северин": 1, "северьян": 1, "северян": 1, "седрик": 1, "сеймур": 1, "селби": 1, "семён": 1, "септембер": 1, "серапион": 1, "серафим": 1, "сергей": 1, "сесил": 1, "сет": 1, "сефтон": 1, "сивард": 1, "сигизмунд": 1, "сигманд": 1, "сид": 1, "сидней": 1, "сидор": 1, "сила": 1, "силас": 1, "силвестр": 1, "сильвер": 1, "сильвест": 1, "сильвестр": 1, "симеон": 1, "симон": 1, "синклэйр": 1, "сирил": 1, "сисар": 1, "скай": 1, "скилар": 1, "скилер": 1, "скот": 1, "скотти": 1, "скуилер": 1, "слава": 1, "слай": 1, "слэйд": 1, "совет": 1, "сократ": 1, "соломон": 1, "сони": 1, "сонни": 1, "софокл": 1, "софон": 1, "спайк": 1, "спарроу": 1, "спартак": 1, "спенсер": 1, "спиридон": 1, "спиро": 1, "стакей": 1, "сталий": 1, "сталь": 1, "станислав": 1, "стаффорд": 1, "степан": 1, "стерлинг": 1, "стеф": 1, "стефан": 1, "сти": 1, "стив": 1, "стивен": 1, "стиви": 1, "стиу": 1, "сторм": 1, "стратон": 1, "сту": 1, "стэки": 1, "стэн": 1, "стэнли": 1, "стэнфорд": 1, "стюарт": 1, "сурен": 1, "сэм": 1, "сэмюэль": 1, "сэнди": 1, "тад": 1, "таддеус": 1, "таир": 1, "тай": 1, "такер": 1, "тал": 1, "талбот": 1, "таннер": 1, "тарас": 1, "таскилл": 1, "таффи": 1, "тед": 1, "тейгу": 1, "тейдж": 1, "теймураз": 1, "тейрк": 1, "текс": 1, "тельнан": 1, "тенгиз": 1, "тенней": 1, "теннизон": 1, "тео": 1, "теобальд": 1, "теодор": 1, "теранс": 1, "теренс": 1, "терентий": 1, "терло": 1, "терранс": 1, "террелл": 1, "терренс": 1, "терстон": 1, "ти": 1, "тиарнак": 1, "тиарнан": 1, "тибалт": 1, "тибби": 1, "тигран": 1, "тигу": 1, "тизон": 1, "тилар": 1, "тилер": 1, "тилор": 1, "тим": 1, "тимми": 1, "тимоти": 1, "тимофей": 1, "тимур": 1, "тирелл": 1, "тирнан": 1, "тирней": 1, "тирон": 1, "тироун": 1, "тиррелл": 1, "тит": 1, "тихомир": 1, "тихон": 1, "тоал": 1, "тоби": 1, "тобиас": 1, "тобин": 1, "товий": 1, "тод": 1, "тодд": 1, "толли": 1, "том": 1, "томас": 1, "томми": 1, "тон": 1, "тони": 1, "топэр": 1, "торез": 1, "торий": 1, "торлей": 1, "торнтон": 1, "травис": 1, "тракей": 1, "трантер": 1, "траффорд": 1, "траэрн": 1, "трев": 1, "тревельян": 1, "тревор": 1, "трейврс": 1, "трейс": 1, "трейси": 1, "трент": 1, "трентон": 1, "тристан": 1, "тристрам": 1, "трифон": 1, "трой": 1, "трофим": 1, "труман": 1, "туллий": 1, "тусон": 1, "тэдди": 1, "тэди": 1, "тэйлер": 1, "тэйлор": 1, "тэйн": 1, "тэйт": 1, "тэл": 1, "тэмпл": 1, "тэрри": 1, "уилбер": 1, "уиллард": 1, "уиллис": 1, "уилфред": 1, "уилфрид": 1, "уильям": 1, "уинстон": 1, "уинфред": 1, "уисдом": 1, "улайксс": 1, "улиссес": 1, "ульяна": 1, "уолли": 1, "уоллис": 1, "уолт": 1, "уолтер": 1, "уолтон": 1, "уорик": 1, "уорнер": 1, "уоррен": 1, "уот": 1, "уоткин": 1, "уптон": 1, "урбан": 1, "уриах": 1, "устин": 1, "уэйн": 1, "уэсли": 1, "фабиан": 1, "фаддей": 1, "фадей": 1, "фалк": 1, "фарид": 1, "фарлей": 1, "фарон": 1, "фарран": 1, "февралин": 1, "федор": 1, "федосий": 1, "фелан": 1, "фелиз": 1, "феликс": 1, "фелим": 1, "фелис": 1, "фентон": 1, "феодосий": 1, "феофан": 1, "ферги": 1, "фергус": 1, "ферд": 1, "ферди": 1, "фердинанд": 1, "фернан": 1, "фернанд": 1, "фестер": 1, "фестус": 1, "фидель": 1, "фидо": 1, "фил": 1, "филайп": 1, "филандр": 1, "филарет": 1, "филат": 1, "филберт": 1, "филимон": 1, "филип": 1, "филипп": 1, "фило": 1, "финикс": 1, "финис": 1, "флегонт": 1, "флемминг": 1, "флечер": 1, "флинн": 1, "флинт": 1, "флойд": 1, "флорентий": 1, "флоренц": 1, "флорин": 1, "флорри": 1, "флурри": 1, "фок": 1, "фокс": 1, "фома": 1, "фонз": 1, "фонзи": 1, "форбес": 1, "форд": 1, "форест": 1, "форрест": 1, "фостер": 1, "фот": 1, "фотий": 1, "фоук": 1, "фразир": 1, "франклин": 1, "франц": 1, "фред": 1, "фредди": 1, "фредерик": 1, "фредрик": 1, "фрейзер": 1, "фрейзр": 1, "фридрих": 1, "фримэн": 1, "фритс": 1, "фродо": 1, "фрол": 1, "фрэнк": 1, "фрэнки": 1, "фрэнклин": 1, "фрэнс": 1, "фрэнсис": 1, "фёдор": 1, "хавелок": 1, "хадвин": 1, "хадлей": 1, "хал": 1, "хам": 1, "хамиш": 1, "хамлет": 1, "хаммонд": 1, "ханк": 1, "ханлей": 1, "хантер": 1, "харв": 1, "харви": 1, "харди": 1, "хардинг": 1, "харитон": 1, "харкоерт": 1, "харлан": 1, "харланд": 1, "харлей": 1, "харлин": 1, "хармон": 1, "харпер": 1, "харрис": 1, "харрисон": 1, "хартлей": 1, "хауелл": 1, "хедлей": 1, "хек": 1, "хендерсон": 1, "хендрик": 1, "хенрай": 1, "хенри": 1, "херб": 1, "херби": 1, "хервей": 1, "херлей": 1, "хиацинт": 1, "хилари": 1, "хиллэри": 1, "хирам": 1, "хис": 1, "хитклифф": 1, "хию": 1, "хоард": 1, "хоб": 1, "ходдж": 1, "хойт": 1, "холден": 1, "холл": 1, "холлис": 1, "хомер": 1, "хопкин": 1, "хорас": 1, "хоратайо": 1, "хоуи": 1, "храбр": 1, "христоф": 1, "христофор": 1, "худд": 1, "хуей": 1, "хует": 1, "хукк": 1, "хукслей": 1, "хумберт": 1, "хунтлей": 1, "хуффи": 1, "хью": 1, "хьюберт": 1, "хьюго": 1, "хьюи": 1, "хэвен": 1, "хэдлей": 1, "хэйвуд": 1, "хэйден": 1, "хэйл": 1, "хэмфри": 1, "хэппи": 1, "хюи": 1, "цезарь": 1, "чад": 1, "чадвик": 1, "чаз": 1, "чак": 1, "чакки": 1, "чарлз": 1, "чарли": 1, "чарлтон": 1, "чарльз": 1, "час": 1, "чейз": 1, "чендлер": 1, "ченс": 1, "черокез": 1, "чеслав": 1, "честер": 1, "чеьянн": 1, "чип": 1, "чонки": 1, "чонси": 1, "ша": 1, "шад": 1, "шаи": 1, "шайенн": 1, "шакуилл": 1, "шамиль": 1, "шамус": 1, "шан": 1, "шаннен": 1, "шаннон": 1, "шау": 1, "шеврон": 1, "шелби": 1, "шелдон": 1, "шеллей": 1, "шелтон": 1, "шем": 1, "шервуд": 1, "шеридан": 1, "шерлок": 1, "шерман": 1, "ши": 1, "шилох": 1, "шимус": 1, "шмидт": 1, "шолто": 1, "шон": 1, "шэй": 1, "шэйн": 1, "эбби": 1, "эбен": 1, "эбенезер": 1, "эвальд": 1, "эван": 1, "эвелин": 1, "эверард": 1, "эверетт": 1, "эверитт": 1, "эвот": 1, "эгберт": 1, "эд": 1, "эдан": 1, "эдвард": 1, "эдвин": 1, "эдгар": 1, "эдди": 1, "эдип": 1, "эдисон": 1, "эдмонд": 1, "эдмунд": 1, "эдон": 1, "эдуард": 1, "эдун": 1, "эзраа": 1, "эзэлстан": 1, "эзэлуолф": 1, "эйб": 1, "эйби": 1, "эйвери": 1, "эйден": 1, "эйлберт": 1, "эйлвард": 1, "эймерей": 1, "эймери": 1, "эйнар": 1, "эйнслей": 1, "эйнсли": 1, "эйс": 1, "элайотт": 1, "элбан": 1, "элвин": 1, "элвис": 1, "элвуд": 1, "элгар": 1, "элдвен": 1, "элдвин": 1, "элден": 1, "элджер": 1, "элдин": 1, "элдис": 1, "элдон": 1, "элдред": 1, "элдус": 1, "электрон": 1, "эли": 1, "элиас": 1, "элиджа": 1, "элиот": 1, "элла": 1, "эллгар": 1, "эллджер": 1, "эллери": 1, "эллиот": 1, "эллис": 1, "элмер": 1, "элрик": 1, "элрой": 1, "элсдон": 1, "эль": 1, "эльберт": 1, "эльбрус": 1, "эльдар": 1, "эльмар": 1, "эльмир": 1, "эльтон": 1, "эмерсон": 1, "эмилиан": 1, "эмилий": 1, "эмиль": 1, "эммануель": 1, "эммануил": 1, "эммерсон": 1, "эммет": 1, "эмметт": 1, "эмори": 1, "эмэри": 1, "энвер": 1, "энгель": 1, "энджелберт": 1, "энди": 1, "эндрю": 1, "энергий": 1, "энтони": 1, "эразм": 1, "эраст": 1, "эрван": 1, "эрвин": 1, "эрг": 1, "эрек": 1, "эрий": 1, "эрик": 1, "эрих": 1, "эрл": 1, "эрлен": 1, "эрн": 1, "эрнест": 1, "эрни": 1, "эрнст": 1, "эрон": 1, "эррол": 1, "эрролл": 1, "этан": 1, "этелберт": 1, "этелред": 1, "этелрик": 1, "этелхард": 1, "эшли": 1, "эюзби": 1, "ювеналий": 1, "юджин": 1, "юлиан": 1, "юлий": 1, "юлиус": 1, "юм": 1, "юниор": 1, "юпитер": 1, "юрий": 1, "юстас": 1, "юстин": 1, "яков": 1, "ян": 1, "янкей": 1, "янки": 1, "януарий": 1, "ярвуд": 1, "яромир": 1, "ярополк": 1, "ярослав": 1}

Capitalize = (s) -> if s then "#{s[0].toUpperCase()}#{s[1..].toLowerCase()}"

exports.inclineMaleName = inclineMaleName = (name) ->
  hardConsonants = "бвгдзклмнпрстфхжшц"
  hissingAndChe =  ["ж","ш","щ","ц","ч"]
  # nominative = yes
  # if name in ruMaleNames        # found!!!
  #   return name: name, cases: {}, src: name, found: yes

  name = Capitalize name
  validEndOfWord = ["а", "б", "в", "г", "д", "ж", "з", "и", "й", "к", "л", "м", "н", "п", "р", "с", "т", "ф", "х", "ь", "я", "ом", "ем", "ий", "ия", "ию", "ии", "ием"]



#  withoutEnd = name[..-2]

  if name.length > 2
    endOfWord = name[-2..]
    if endOfWord in validEndOfWord
      withoutEnd = name[..-3]
    else
      endOfWord = name[-1..]
  else
    endOfWord = name[-1..]


#  endOfWord = "" if endOfWord in hardConsonants
  lastLetter = name[-1..]
  if lastLetter in hardConsonants && 1 < endOfWord.length
    withoutEnd = name
  else
    withoutEnd = name[..-(1 + endOfWord.length)]

  # console.log "ll = #{lastLetter}\t eow = #{endOfWord}\t withoutEnd = #{withoutEnd} \n ll in hc #{lastLetter} in #{hardConsonants}"


  if endOfWord in hissingAndChe || endOfWord in ["а","у","e","ем"] && "ием" != name[-3..]
    console.log "#1"
    if "ем" == endOfWord
      withoutEnd = name[..-3]
    else if endOfWord in hissingAndChe
      withoutEnd = name
    cases = ["#{withoutEnd}", "#{withoutEnd}а", "#{withoutEnd}у", "#{withoutEnd}а", "#{withoutEnd}ем", "#{withoutEnd}е"]

  else if endOfWord in hardConsonants || ((withoutEnd[-1..] in hardConsonants) && endOfWord in ["а","у","е","ом"])
    console.log "#2"
    if "ом" == endOfWord
      withoutEnd = name[..-3]
    else if endOfWord in hardConsonants
      withoutEnd = name
    cases = ["#{withoutEnd}", "#{withoutEnd}а", "#{withoutEnd}у", "#{withoutEnd}а", "#{withoutEnd}ом", "#{withoutEnd}е"]

  else if endOfWord in ["ь", "й"]
    console.log "#3"
    cases = ["#{withoutEnd}#{endOfWord}", "#{withoutEnd}я", "#{withoutEnd}ю", "#{withoutEnd}я", "#{withoutEnd}ем", "#{withoutEnd}е"]

  else if endOfWord in ["ий", "ия", "ию", "ии", "ем"]
    console.log "#4"
    if "ем" == endOfWord        # ием
      withoutEnd = name[..-3]
    else
      withoutEnd += "и"
    cases = ["#{withoutEnd}й", "#{withoutEnd}я", "#{withoutEnd}ю", "#{withoutEnd}я", "#{withoutEnd}ем", "#{withoutEnd}и"]

  else
    console.log "#5"
    cases = [""]

  # todo add more exceptions here
  result = name: cases[0], cases: cases, src: name, found: cases[0].toLowerCase() in ruMaleNames

  result.possible_yes = result.found || endOfWord in validEndOfWord
  caseIndex = cases.indexOf name
  result.guess_case_index = caseIndex
  result.guess_case = if -1 == caseIndex then "unknown" else ["nominative","genitive","dative","accusative","instrumental","prepositional"][caseIndex]
  result

exports.doInclineMaleName = doInclineMaleName = (name) ->
  hardConsonants = /((б)|(в)|(г)|(д)|(з)|(к)|(л)|(м)|(н)|(п)|(р)|(с)|(т)|(ф)|(х))$/g
  hissingAndChe = /((ж)|(ш)|(щ)|(ц)|(ч))$/g
  ishortRe = /((ай)|(ей)|(ой)|(уй)|(яй)|(юй)|(ий))$/g
  aNotAfterHissingAndOthersRe = /[^шщцгкхч]а$/g

  aAfterHissingAndOthersRe = /[шщцгкхч]а$/g
  name2 = name[..-2]
  if name == "Лев"
    ["Лев", "Льва", "Льву", "Льва", "Львом", "Льве"]
  else if name == "Павел"
    ["Павел", "Павла", "Павлу", "Павла", "Павлом", "Павле"]
  else if /и$/g.test name       # georgian names
    [name, name, name, name, name, name]
  else if hissingAndChe.test name
    [name, "#{name}а", "#{name}у", "#{name}а", "#{name}ем", "#{name}е"]
  else if hardConsonants.test name
    [name, "#{name}а", "#{name}у", "#{name}а", "#{name}ом", "#{name}е"]
  else if /ь$/g.test name
    ["#{name2}ь", "#{name2}я", "#{name2}ю", "#{name2}я", "#{name2}ем", "#{name2}е"]
  else if ishortRe.test name
    ["#{name2}й", "#{name2}я", "#{name2}ю", "#{name2}я", "#{name2}ем", "#{name2}е"]
  else if aNotAfterHissingAndOthersRe.test name
    ["#{name2}а", "#{name2}ы", "#{name2}е", "#{name2}у", "#{name2}ой", "#{name2}е"]
  else if aAfterHissingAndOthersRe.test name
    ["#{name2}а", "#{name2}и", "#{name2}е", "#{name2}у", "#{name2}ой", "#{name2}е"]
  else if /я$/g.test name
    ["#{name2}я", "#{name2}и", "#{name2}е", "#{name2}ю", "#{name2}ей", "#{name2}е"]
  else if /ко$/g.test name
    ["#{name2}о", "#{name2}и", "#{name2}е", "#{name2}у", "#{name2}ой", "#{name2}е"]
  else if /о$/g.test name
    ["#{name2}о", "#{name2}ы", "#{name2}е", "#{name2}у", "#{name2}ой", "#{name2}е"]
  else
    null

inclineAndGetResult = ->
  r = null
  for i, name of arguments
    r = inclineMaleName2 name, yes
    if r.found
      break
  r


exports.inclineMaleName2 = inclineMaleName2 = (name, nominativeOnly=no) ->
  name = "Лев" if name == "Льв"
  name = "Павел" if name == "Павл"

  nl = name.toLowerCase()
  nominativeRe = /([вгдзклмнпрстфхжшцьй]|(ба)|(ва)|(да)|(за)|(ла)|(ма)|(на)|(па)|(ра)|(са)|(та)|(фа)|(га)|(ка)|(ха)|(жа)|(ша)|(ща)|(ца)|(ча)|(я)|(ло)|(ко))$/g
  canInclineRe = /([бвгдзклмнпрстфхжшцьая]|(ия)|(ья)|(ея)|(ий)|(ей))$/g
  genitiveRe = /[аяыи]$/g
  dativeRe = /(([еую])|(ии))$/g
  accusativeRe = /[аяую]$/g
  instrumentalRe = /((ом)|(ем)|(ой)|(ей)|(ёй))$/g
  prepositionalRe = /((е)|(ии))$/g
#  vowels = "аеиоуэюя"
  name2 = name[..-2]
  result = {}
  if nominativeRe.test(nl) && ruMaleNamesDict[nl]

    if canInclineRe.test nl
      cases = doInclineMaleName name
      possible_cases = ["nominative"]
    else                        # check for inclines by passing through case regexps
      cases = [name, name, name, name, name, name]
      possible_cases = ["nominative", "genetive", "dative", "accusative", "instrumental", "prepositional"]
    return  {found: yes, gender: "male", src: name, cases: cases, guess_case: "nominative", nominative: name, possible_cases: possible_cases}
  else if nominativeOnly
    return {found: no, src: name}

  cases = []
  if genitiveRe.test nl
    # replacement table:
    # а -> (nil)
    # [аеуоия]я -> й
    # [бвдзмнпрлс]я -> ь
    # и -> а,я
    # ы -> о
    if /[а]$/g.test nl
      result = inclineAndGetResult name2
    else if /[аеуоия]я$/g.test nl
      result = inclineAndGetResult "#{name[..-2]}й"
    else if /[бвдзмнпрлс]я$/g.test nl
      result = inclineAndGetResult "#{name[..-2]}ь"
    else if /ы$/g.test nl
      result = inclineAndGetResult "#{name2}о", "#{name2}а"
    else if /и$/g.test nl
      result = inclineAndGetResult "#{name[..-2]}а", "#{name[..-2]}я", "#{name[..-2]}о"
    else
      return {found: no, src: name}
    cases.push "genetive"
  if dativeRe.test nl
    if /у$/g.test nl
      result = inclineMaleName2 name2
    else if /[аеиоуя]ю$/g.test nl
      result = inclineAndGetResult "#{name2}й"
    else if /ю$/g.test nl
      result = inclineAndGetResult "#{name2}ь"
    else if /е$/g.test nl
      result = inclineAndGetResult "#{name2}и", "#{name2}я", "#{name2}o"
    else if /ии$/g.test nl
      result = inclineAndGetResult "#{name2}я"
    else
      return  {found: no}
    cases.push "dative"
  if accusativeRe.test nl
    if /[а]$/g.test nl
      result = inclineAndGetResult name2
    else if /[аеуоия]я$/g.test nl
      result = inclineAndGetResult "#{name[..-2]}й"
    else if /[бвдзмнпрлс]я$/g.test nl
      result = inclineAndGetResult "#{name[..-2]}ь"
    else if /у$/g.test nl
      result = inclineAndGetResult  "#{name2}а"
    else if /[ую]$/g.test nl
      result = inclineAndGetResult "#{name2}а", "#{name2}я", "#{name2}о"
    else
      return {found: no}
    cases.push "accusative"
  if instrumentalRe.test nl
    # ом ем ой ей
    if /ом$/g.test nl
      result = inclineAndGetResult "#{name[..-3]}"
    else if /ем$/g.test nl
      result = inclineAndGetResult "#{name[..-3]}", "#{name[..-3]}ь", "#{name[..-3]}й"
    else if /ой$/g.test nl
      result = inclineAndGetResult "#{name[..-3]}а", "#{name[..-3]}о"
    else if /((ей)|(ёй))$/g.test nl
      result = inclineAndGetResult "#{name[..-3]}я", "#{name[..-3]}а"
    else
      return {found: no}
    cases.push "instrumental"
  if prepositionalRe.test nl
    if /е$/g.test nl
      result = inclineAndGetResult name2, "#{name2}ь", "#{name2}й", "#{name2}а", "#{name2}я", "#{name2}о"
    else if /и$/g.test nl
      result = inclineAndGetResult "#{name2}я", "#{name2}й"
    else
      return {found: no}
    cases.push "prepositional"
#  console.log "and result is: #{sys.inspect result}"
  result.src = name
  result.possible_cases = cases
  result.guess_case = cases[0]
  result

exports.inclineFemName = inclineFemName = (name) ->
  name = Capitalize name
  validEndOfWord = ["ч", "щ","ш","ж","ь","и","а","я","ы","ю","е","й","ю","ии","ия","ая","ей","ой","ию","йю","ью"]
  withoutEnd = name[..-2]


  if name.length > 2
    endOfWord = name[-2..]
    if endOfWord in validEndOfWord
      withoutEnd = name[..-3]
    else
      endOfWord = name[-1..]
  else
    endOfWord = name[-1..]

  lastLetter = withoutEnd[-1..]

  if endOfWord == "ь" || ( endOfWord == "ью" && !(withoutEnd[-1..] in "жшчщ"))
    cases = ["#{withoutEnd}ь", "#{withoutEnd}и", "#{withoutEnd}и", "#{withoutEnd}ь", "#{withoutEnd}ью", "#{withoutEnd}и"]
  else if endOfWord == "ью" && withoutEnd[-1..] in "жшчщ"
    cases = ["#{withoutEnd}", "#{withoutEnd}и", "#{withoutEnd}и", "#{withoutEnd}", "#{withoutEnd}ью", "#{withoutEnd}и"]

  else if endOfWord in "жшчщ"
    withoutEnd += endOfWord
    cases = ["#{withoutEnd}", "#{withoutEnd}и", "#{withoutEnd}и", "#{withoutEnd}", "#{withoutEnd}ью", "#{withoutEnd}и"]

  else if endOfWord in "ияюе"
    cases = ["#{withoutEnd}я", "#{withoutEnd}и", "#{withoutEnd}е", "#{withoutEnd}ю", "#{withoutEnd}ей", "#{withoutEnd}е"]
  else if lastLetter in  "жшчщцгкх"
    cases = ["#{withoutEnd}а", "#{withoutEnd}и", "#{withoutEnd}е", "#{withoutEnd}у", "#{withoutEnd}ой", "#{withoutEnd}е"]
  else
    cases = ["#{withoutEnd}а", "#{withoutEnd}ы", "#{withoutEnd}е", "#{withoutEnd}у", "#{withoutEnd}ой", "#{withoutEnd}е"]

  # todo add more exceptions here
  result = name: cases[0], found: cases[0].toLowerCase() in ruFemNames, cases: cases, src: name

  result.possible_yes = result.found || endOfWord in validEndOfWord
  caseIndex = cases.indexOf name
  result.guess_case_index = caseIndex
  result.guess_case = if -1 == caseIndex then "unknown" else ["nominative","genitive","dative","accusative","instrumental","prepositional"][caseIndex]
  result

inclineName = (name) ->
  fn = inclineFemName name
  mn = inclineMaleName2 name
#  console.log "fn = #{sys.inspect fn}\nmn = #{sys.inspect mn}"
  if fn.found                   # female
    result = {found: yes, src: name, gender: "female", guess_case: fn.guess_case, female_cases: fn.cases, nominative: fn.name}
  else if mn.found
    result = {found: yes, src: name, gender: "male", guess_case: mn.guess_case, male_cases: mn.cases, nominative: mn.nominative}
  else
    # word may be a name
    if fn.possible_yes && mn.possible_yes
      result = {found: "maybe", src: name, gender: ["male", "female"], female_cases: fn.cases, male_cases: mn.cases}
      result.guess_case = if fn.guess_case_index <= mn.guess_case_index then fn.guess_case else mn.guess_case
    else if fn.possible_yes
      result = {found: "maybe", src: name, gender: "female", female_cases: fn.cases, guess_case: fn.cases}
    else if mn.possible_yes
      result = {found: "maybe", src: name, gender: "male", male_cases: mn.cases, guess_case: mn.cases}
    else
      result = {found: no, src: name}
  result

inclineSurname = (surname, noInclinesRe, inclineRe, casesRe) ->
  result = found: null,  src: surname, cases: null, cases_index: null
  if noInclinesRe && noInclinesRe.test(surname)
    # cases: [surname, surname, surname, surname, surname, surname],
    result = found: surname,  src: surname, cases: ["nominative","genitive","dative","accusative","instrumental","prepositional"], cases_index: [0,1,2,3,4,5]
  else
    for check in inclineRe
      if check[0].test surname
        result = found: surname.replace(check[0], check[1]), src: surname
        cases_index = []
        cases = []
        i = 0
        for c in casesRe
          if c.test surname
            cases_index.push i
            cases.push ["nominative","genitive","dative","accusative","instrumental","prepositional"][i]
          i++
        if cases.length == 0
          result.found = null
          result.cases = null
        else
          result.cases = cases
        result.cases_index = cases_index
        break
  if result.cases
    result.guess_case = result.cases[0]
  result

exports.inclineFemSurname = inclineFemSurname = (surname) ->
  noInclinesRe = /((их)|(ых)|(е)|(о)|(э)|(и)|(ы)|(^[нв]у)|(^ую)|(уа)|(иа)|(ман)|(вич))$/g
  inclineRe = [
    [/((ова)|(овой)|(ову))$/g, "ова"]
    [/((ева)|(евой)|(еву))$/g, "ева"]
    [/((ёва)|(ёвой)|(ёву))$/g, "ёва"]
    [/((ина)|(иной)|(ину))$/g, "ина"]
    [/((ая)|(ой)|(ую))$/g, "ая"]
    ]
  casesRe = [
    /((ова)|(ева)|(ёва)|(ина)|(ая))$/g,
    /((овой)|(евой)|(ёвой)|(иной)|(ой))$/g,
    /((овой)|(евой)|(ёвой)|(иной)|(ой))$/g,
    /((ову)|(еву)|(ёву)|(ину)|(ую))$/g,
    /((овой)|(евой)|(ёвой)|(иной)|(ой))$/g,
    /((овой)|(евой)|(ёвой)|(иной)|(ой))$/g
    ]

  inclineSurname surname, noInclinesRe, inclineRe, casesRe


exports.inclineMaleSurname = inclineMaleSurname = (surname) ->
  noInclinesRe = /((их)|(ых)|(^ве)|(^го)|(э)|(и)|(ы)|(^му)|(ю)|(уа)|(иа))$/g
  inclineRe = [
    [/((ов)|(ова)|(ову)|(овым)|(ове))$/g, "ов"]
    [/((ев)|(ева)|(еву)|(евым)|(еве))$/g, "ев"]
    [/((ёв)|(ёва)|(ёву)|(ёвым)|(ёве))$/g, "ёв"]
    [/((ин)|(ина)|(ину)|(иным)|(ине))$/g, "ин"]
    [/((ский)|(ского)|(скому)|(ским)|(ском))$/g, "ский"]
    [/((ской)|(ского)|(скому)|(ским)|(ском))$/g, "ской"]
    [/((ман)|(мана)|(ману)|(маном)|(мане))$/g, "ман"]
    [/((ой)|(ого)|(ому)|(ого)|(ым)|(ом))$/g, "ой"]
    [/((ий)|(ого)|(ому)|(ого)|(им)|(ом))$/g, "ий"]
    [/((ый)|(ого)|(ому)|(ого)|(ым)|(ом))$/g, "ый"]
    [/((ич)|(ича)|(ичу)|(ича)|(ичем)|(иче))$/g, "ич"]
    ]
  casesRe = [
    /((ов)|(ев)|(ёв)|(ин)|(ский)|(ской)|(ой)|(ий)|(ый)|(ман)|(ич))$/g,
    /((ова)|(ева)|(ёва)|(ина)|(ского)|(ого)|(мана)|(ича))$/g,
    /((ову)|(еву)|(ёву)|(ину)|(скому)|(ому)|(ману)|(ичу))$/g,
    /((ова)|(ева)|(ёва)|(ина)|(ского)|(ого)|(мана)|(ича))$/g,
    /((овым)|(евым)|(ёвым)|(иным)|(ским)|(им)|(ым)|(маном)|(ичем))$/g,
    /((ове)|(еве)|(ёве)|(ине)|(ском)|(ом)|(мане)|(иче))$/g
    ]
  inclineSurname surname, noInclinesRe, inclineRe, casesRe


inclineMiddleNameOrSurname = (src, fem, male) ->
  if fem.found == male.found == null
    result = {found: no, src: src, value: null, gender: null}
  else if fem.found && male.found
#    console.log "эм жо!!!\n\n#{sys.inspect fem}\n\n"
    result = {found: yes, src: src, gender: ["male", "female"]}
    result.nominative_male = male.found
    result.nominative_female = fem.found
    result.female_cases = fem.cases
    result.male_cases = male.cases
    if fem.cases.length == 6 # not inclined
      if male.cases.length == 6   # not inclined too, unknown
        result.guess_sex = "unknown"
      else # suppose, that it's a man
        result.guess_sex = "male"
        result.nominative = male.found
    # nominative female, and multiple male cases, suppose it's a woman
    else if fem.cases.length == 1 && male.cases.length > 1
      result.guess_sex = "female"
      result.nominative = fem.found
  else if !fem.found
    result = {found: yes, src: src, gender: "male", male_cases: male.cases, guess_case: male.guess_case, nominative: male.found}
  else if !male.found
    result = {found: yes, src: src, gender: "female", female_cases: fem.cases, guess_case: fem.guess_case, nominative: fem.found}

  result


exports.inclineSurname = inclinePersonSurname = (surname) ->
  inclineMiddleNameOrSurname surname, inclineFemSurname(surname), inclineMaleSurname(surname)


exports.inclineMaleMiddleName = inclineMaleMiddleName = (mname) ->
  inclineRe = [
    [/(евич)|(евичу)|(евичу)|(евича)|(евичем)|(евиче)$/g, "евич"],
    [/(ович)|(овичу)|(овичу)|(овича)|(овичем)|(овиче)$/g, "ович"],
    ]
  casesRe = [
    /((евич)|(ович))$/g,
    /((евичу)|(овичу))$/g,
    /((евичу)|(овичу))$/g,
    /((евича)|(овича))$/g,
    /((евичем)|(овичем))$/g,
    /((евиче)|(овиче))$/g
    ]
  inclineSurname mname, null, inclineRe, casesRe

exports.inclineFemMiddleName = inclineFemMiddleName = (mname) ->
  inclineRe = [
    [/(вна)|(вной)|(вне)|(вну)|(вной)|(вне)$/g, "вна"],
    [/(чна)|(чной)|(чне)|(чну)|(чной)|(чне)$/g, "чна"]
    ]
  casesRe = [
    /((вна)|(чна))$/g,
    /((вной)|(чной))$/g,
    /((вне)|(чне))$/g,
    /((вну)|(чну))$/g,
    /((вной)|(чной))$/g,
    /((вное)|(чне))$/g
    ]
  inclineSurname mname, null, inclineRe, casesRe


exports.inclineMiddleName = inclineMiddleName = (mname) ->
  inclineMiddleNameOrSurname mname, inclineFemMiddleName(mname), inclineMaleMiddleName(mname)


#--------------------------------------------------------------------------------
genderMatch = (g1, g2) ->
  if g1 == g2 || g1 in g2
    g1
  else if g2 in g1
    g2
  else
    null

matchCase = (pObj, target_case, gender) ->
  target_case in pObj["#{gender}_cases"]

getNominative = (pObj, gender) ->
  gnstr = "nominative_#{gender}"
  nom =  pObj.nominative && pObj.nominative || pObj[gnstr]
#  console.log "#{gender} nominative = #{nom} \npObj = #{pObj[gnstr]} nom = #{nom}\n\n"
  nom

exports.findProperName = (listOfWords, opts={}) ->
  switch listOfWords.length
    when 1                      # just surname
      result =  inclinePersonSurname listOfWords[0]
      if result.found
        console.log "found surname"
        return result
      else
        console.log "not found((, name? \n#{sys.inspect inclineName listOfWords[0]}"
        null
    when 2
      sResult1 = inclinePersonSurname listOfWords[0]
      sResult2 = inclinePersonSurname listOfWords[1]

      nResult1 = inclineName listOfWords[0]
      nResult2 = inclineName listOfWords[1]

      surnameFound = sResult1.found || sResult2.found
      nameFound = nResult1.found || nResult2.found
      if !surnameFound || !nameFound
        console.log "not a proper name!"
      else                      # find name first
        if yes == nResult1.found == nResult2.found
          return null            # two names!
        if yes == nResult1.found# name found
          gender = nResult1.gender
          guess_case = nResult1.guess_case
          r = {name: nResult1.nominative, surname: getNominative(sResult2, gender), found: yes, gender: gender, order: "normal"}
          sResult = sResult2
        else if yes == nResult2.found
          gender = nResult2.gender
          guess_case = nResult2.guess_case
          r = {name: nResult2.nominative, surname: getNominative(sResult1, gender), found: yes, gender: gender, order: "reverse"}
          sResult = sResult1
        else
          console.log "suspicios name!!"
          return null
        sGender = genderMatch gender, sResult.gender
        if !sGender
          return {found: no, error: "missmatch gender"}
        else if matchCase sResult, guess_case, sGender
          return r
        else
          return {found: no, error: "missmatch case (#{sys.inspect sResult2})"}

    when 3
      console.log "three cases!"
    else
      console.log "WTF"
  console.log "fY"