
ruFemNames = ["Августа", "Августина", "Авдотья", "Авелина", "Аврелия", "Аврора", "Агапия", "Агата", "Агафья", "Агафия", "Аглаида", "Аглая", "Агнеса", "Агнесса", "Агния", "Агриппина", "Агрефена", "Ада", "Адель", "Аделия", "Аделаида", "Аза", "Азалия", "Аида", "Акилина", "Акулина", "Аксинья", "Алевтина", "Александра", "Алёна", "Алина", "Алиса", "Алла", "Альбина", "Альвина", "Анастасия", "Анатолия", "Ангелина", "Анжела", "Анимаиса", "Анисия", "Анисья", "Анита", "Анна", "Антонина", "Антонида", "Антония", "Анфиса", "Анфуса", "Анфия", "Ариадна", "Арина", "Аркадия", "Арсения", "Артемия", "Аста", "Астра", "Астрид", "Афанасия", "Афродита", "Аэлита", "Аэлла", "Бажена", "Беата", "Беатриса", "Бела", "Белла", "Берта", "Богдана", "Болеслава", "Борислава", "Бронислава", "Валентина", "Валерия", "Ванда", "Варвара", "Василина", "Василиса", "Васса", "Вацлава", "Вевея", "Венера", "Вера", "Вероника", "Веселина", "Веста", "Видана", "Викторина", "Виктория", "Вилена", "Вилора", "Вилория", "Виола", "Виолетта", "Виоланта", "Виринея", "Виталия", "Виталина", "Влада", "Владилена", "Владимира", "Владислава", "Владлена", "Власта", "Воля", "Всеслава", "Гайя", "Гали", "Галина", "Ганна", "Гаяна", "Гаяния", "Гелена", "Гелия", "Гелла", "Гертруда", "Глафира", "Гликерия", "Глория", "Горислава", "Дайна", "Дана", "Дарья", "Дария", "Дарина", "Дарьяна", "Декабрина", "Дея", "Дия", "Джульетта", "Диана", "Дина", "Диния", "Диодора", "Дионисия", "Добрава", "Домна", "Домина", "Домника", "Доминика", "Донара", "Дорофея", "Доротея", "Ева", "Евгения", "Евдокия", "Евлалия", "Евпраксия", "Евстолия", "Евфалия", "Екатерина", "Елена", "Елизавета", "Еликонида", "Ермиония", "Ефимия", "Евфимия", "Ефросиния", "Евфросиния", "Жанна", "Ждана", "Зара", "Зарема", "Зарина", "Зорина", "Звенислава", "Зинаида", "Зиновия", "Злата", "Зоя", "Иванна", "Ида", "Илария", "Илиана", "Илона", "Инга", "Инесса", "Инна", "Иоанна", "Иона", "Ипатия", "Ипполита", "Ираида", "Ироида", "Ираклия", "Ирина", "Исидора", "Искра", "Ифигения", "Ия", "Калерия", "Калиса", "Капитолина", "Карина", "Каролина", "Катерина", "Кира", "Кирилла", "Клавдия", "Клара", "Клариса", "Кларисса", "Клеопатра", "Конкордия", "Констанция", "Кристина", "Ксения", "Лада", "Лариса", "Лениана", "Ленина", "Леонида", "Леонила", "Леонтия", "Леся", "Ливия", "Лидия", "Лилиана", "Лилия", "Лина", "Лия", "Лея", "Лора", "Луиза", "Лукерия", "Лукиана", "Лукина", "Люцина", "Любава", "Любовь", "Любомира", "Людмила", "Мавра", "Магда", "Магдалина", "Мадлен", "Майя", "Мая", "Мальвина", "Маргарита", "Мариана", "Марьяна", "Марианна", "Мариетта", "Мариэтта", "Марина", "Мария", "Марья", "Мари", "Марлена", "Марта", "Марфа", "Матильда", "Матрёна", "Матрона", "Мелания", "Меланья", "Мелитина", "Милада", "Милана", "Милена", "Милица", "Милия", "Милослава", "Мира", "Мирра", "Мирослава", "Митродора", "Млада", "Мстислава", "Муза", "Нада", "Надежда", "Надия", "Наина", "Нана", "Настасья", "Наталья", "Наталия", "Нелли", "Неонила", "Ника", "Нина", "Нинелла", "Нинель", "Новелла", "Нонна", "Оксана", "Октавия", "Октябрина", "Олеся", "Оливия", "Олимпиада", "Олимпия", "Ольга", "Павла", "Павлина", "Пелагея", "Платонида", "Поликсена", "Полина", "Правдина", "Нора", "Прасковья", "Рада", "Радмила", "Раиса", "Раймонда", "Ревмира", "Регина", "Рената", "Римма", "Рогнеда", "Роза", "Розалия", "Розана", "Ростислава", "Руслана", "Руфина", "Руфь", "Сабина", "Савина", "Саломея", "Соломея", "Светлана", "Светозара", "Светослава", "Свобода", "Святослава", "Севастьяна", "Северина", "Селена", "Селина", "Серафима", "Сильва", "Сильвия", "Симона", "Слава", "Славяна", "Снежана", "Софья", "София", "Станислава", "Стелла", "Степанида", "Стефанида", "Стефания", "Сусанна", "Сосанна", "Сюзанна", "Таира", "Таисия", "Тальяна", "Тамара", "Тамила", "Томила", "Татьяна", "Текуса", "Тереза", "Улита", "Ульяна", "Услада", "Устинья", "Фаина", "Февронья", "Феликсана", "Фелицата", "Фелицитата", "Фелиция", "Федора", "Феодора", "Феодосия", "Феодосья", "Феоктиста", "Феофания", "Феона", "Флавия", "Флора", "Флория", "Флорентина", "Флоренция", "Флориана", "Фотина", "Харита", "Харитина", "Хиония", "Христина", "Цецилия", "Чеслава", "Эвелина", "Эвридика", "Эдда", "Элеонора", "Элина", "Эльвира", "Эльмира", "Эльза", "Эмилия", "Эмма", "Эрика", "Эсфирь", "Юдифь", "Юзефа", "Юлиана", "Юлитта", "Юлия", "Юманита", "Юния", "Юнона", "Юстина", "Ядвига", "Яна", "Янина", "Яромира", "Ярослава"].map (x) -> x.toLowerCase()

ruMaleNames = ["Абрам", "Август", "Авдей", "Адам", "Адольф", "Адриан", "Аким", "Александр", "Алексей", "Альберт", "Альфред", "Анатолий", "Андрей", "Аникита", "Антон", "Ануфрий", "Арам", "Арий", "Аристарх", "Аркадий", "Арнольд", "Арон", "Арсен", "Артем", "Артемий", "Артур", "Аскольд", "Афанасий", "Ахмет", "Ашот","Бенедикт", "Бернар", "Богдан", "Болеслав", "Бонифаций", "Борис", "Борислав", "Бронислав","Вадим", "Валентин", "Валерий", "Вальтер", "Василий", "Велор", "Венедикт", "Вениамин", "Виктор", "Вилли", "Вильгельм", "Виссарион", "Виталий", "Владимир", "Владислав", "Вольдемар", "Всеволод", "Вячеслав","Гавриил", "Гарри", "Геннадий", "Генрих", "Георгий", "Геральд", "Герасим", "Герман", "Глеб", "Гордей", "Градимир", "Григорий", "Гурий","Давыд", "Даниил", "Демид", "Демьян", "Денис", "Дмитрий", "Донат", "Дорофей","Евгений", "Евдоким", "Евстафий", "Егор", "Елисей", "Емельян", "Ермолай", "Ерофей", "Ефим", "Ефрем","Жорж","Захар", "Зигмунд", "Зиновий","Ибрагим", "Иван", "Игнат", "Игорь", "Измаил", "Израиль", "Илларион", "Илья", "Иннокентий", "Ион", "Иосиф", "Ираклий", "Исай","Казимир", "Карен", "Карл", "Кирилл", "Клавдий", "Клемент", "Клим", "Кондрат", "Конкордий", "Константин", "Кузьма","Лазарь", "Лев", "Леван", "Леонард", "Леонид", "Леонтий", "Леопольд", "Лука", "Любомир", "Людвиг","Май", "Макар", "Максим", "Максимилиан", "Марат", "Мариан", "Марк", "Мартин", "Матвей", "Мераб", "Мечеслав", "Мирон", "Мирослав", "Михаил", "Модест", "Моисей", "Мурат","Назар", "Натан", "Наум", "Никита", "Никифор", "Николай", "Никон", "Нисон", "Нифонт","Олег", "Олесь", "Онисим", "Орест", "Осип", "Оскар","Павел", "Парамон", "Петр", "Платон", "Прохор","Равиль", "Радий", "Рафик", "Рашид", "Ринат", "Ричард", "Роберт", "Родион", "Ролан", "Роман", "Ростислав", "Рубен", "Рудольф", "Руслан", "Рустам","Савва", "Савел", "Самсон", "Святослав", "Севастьян", "Семен", "Серафим", "Сергей", "Соломон", "Спартак", "Станислав", "Степан", "Стоян","Тамаз", "Тарас", "Теодор" , "Терентий", "Тигран", "Тимофей", "Тимур", "Тит", "Тихон", "Трифон", "Трофим","Устин","Федор", "Феликс", "Феодосий", "Филимон", "Филипп", "Фома", "Фридрих","Харитон", "Христиан", "Христофор","Эдуард", "Эльдар", "Эмиль", "Эммануил", "Эрик", "Эрнест","Юлиан", "Юрий","Яким", "Яков", "Ян", "Ярослав"].map (x) -> x.toLowerCase()


Capitalize = (s) -> if s then "#{s[0].toUpperCase()}#{s[1..].toLowerCase()}"

exports.inclineMaleName = inclineMaleName = (name) ->
  hardConsonants = "бвгдзклмнпрстфхжшц"
  hissingAndChe =  ["ж","ш","щ","ц","ч"]
  name = Capitalize name
  validEndOfWord = ["а", "б", "в", "г", "д", "ж", "з", "и", "й", "к", "л", "м", "н", "п", "р", "с", "т", "ф", "х", "ь", "я", "ом", "ем", "ий", "ия", "ию", "ии", "ием"]

#  withoutEnd = name[..-2]

  if name.length > 2
    endOfWord = name[-2..]
    if endOfWord in validEndOfWord
      withoutEnd = name[..-3]
    else
      endOfWord = name[-1..]
  else
    endOfWord = name[-1..]


#  endOfWord = "" if endOfWord in hardConsonants
  lastLetter = name[-1..]
  if lastLetter in hardConsonants && 1 < endOfWord.length
    withoutEnd = name
  else
    withoutEnd = name[..-(1 + endOfWord.length)]

  console.log "ll = #{lastLetter}\t eow = #{endOfWord}\t withoutEnd = #{withoutEnd} \n ll in hc #{lastLetter} in #{hardConsonants}"


  if endOfWord in hissingAndChe || endOfWord in ["а","у","e","ем"] && "ием" != name[-3..]
    console.log "#1"
    if "ем" == endOfWord
      withoutEnd = name[..-3]
    else if endOfWord in hissingAndChe
      withoutEnd = name
    cases = ["#{withoutEnd}", "#{withoutEnd}а", "#{withoutEnd}у", "#{withoutEnd}а", "#{withoutEnd}ем", "#{withoutEnd}е"]

  else if endOfWord in hardConsonants || ((withoutEnd[-1..] in hardConsonants) && endOfWord in ["а","у","е","ом"])
    console.log "#2"
    if "ом" == endOfWord
      withoutEnd = name[..-3]
    else if endOfWord in hardConsonants
      withoutEnd = name
    cases = ["#{withoutEnd}", "#{withoutEnd}а", "#{withoutEnd}у", "#{withoutEnd}а", "#{withoutEnd}ом", "#{withoutEnd}е"]

  else if endOfWord in ["ь", "й"]
    console.log "#3"
    cases = ["#{withoutEnd}#{endOfWord}", "#{withoutEnd}я", "#{withoutEnd}ю", "#{withoutEnd}я", "#{withoutEnd}ем", "#{withoutEnd}е"]

  else if endOfWord in ["ий", "ия", "ию", "ии", "ем"]
    console.log "#4"
    if "ем" == endOfWord        # ием
      withoutEnd = name[..-3]
    else
      withoutEnd += "и"
    cases = ["#{withoutEnd}й", "#{withoutEnd}я", "#{withoutEnd}ю", "#{withoutEnd}я", "#{withoutEnd}ем", "#{withoutEnd}и"]

  else
    console.log "#5"
    cases = [""]

  # todo add more exceptions here
  result = name: cases[0], cases: cases, src: name, found: cases[0].toLowerCase() in ruMaleNames

  result.possible_yes = result.found || endOfWord in validEndOfWord
  caseIndex = cases.indexOf name
  result.guess_case_index = caseIndex
  result.guess_case = if -1 == caseIndex then "unknown" else ["nominative","genitive","dative","accusative","instrumental","prepositional"][caseIndex]
  result



exports.inclineFemName = inclineFemName = (name) ->
  name = Capitalize name
  validEndOfWord = ["ч", "щ","ш","ж","ь","и","а","я","ы","ю","е","й","ю","ии","ия","ая","ей","ой","ию","йю","ью"]
  withoutEnd = name[..-2]


  if name.length > 2
    endOfWord = name[-2..]
    if endOfWord in validEndOfWord
      withoutEnd = name[..-3]
    else
      endOfWord = name[-1..]
  else
    endOfWord = name[-1..]

  lastLetter = withoutEnd[-1..]

  if endOfWord == "ь" || ( endOfWord == "ью" && !(withoutEnd[-1..] in "жшчщ"))
    cases = ["#{withoutEnd}ь", "#{withoutEnd}и", "#{withoutEnd}и", "#{withoutEnd}ь", "#{withoutEnd}ью", "#{withoutEnd}и"]
  else if endOfWord == "ью" && withoutEnd[-1..] in "жшчщ"
    cases = ["#{withoutEnd}", "#{withoutEnd}и", "#{withoutEnd}и", "#{withoutEnd}", "#{withoutEnd}ью", "#{withoutEnd}и"]

  else if endOfWord in "жшчщ"
    withoutEnd += endOfWord
    cases = ["#{withoutEnd}", "#{withoutEnd}и", "#{withoutEnd}и", "#{withoutEnd}", "#{withoutEnd}ью", "#{withoutEnd}и"]

  else if endOfWord in "ияюе"
    cases = ["#{withoutEnd}я", "#{withoutEnd}и", "#{withoutEnd}е", "#{withoutEnd}ю", "#{withoutEnd}ей", "#{withoutEnd}е"]
  else if lastLetter in  "жшчщцгкх"
    cases = ["#{withoutEnd}а", "#{withoutEnd}и", "#{withoutEnd}е", "#{withoutEnd}у", "#{withoutEnd}ой", "#{withoutEnd}е"]
  else
    cases = ["#{withoutEnd}а", "#{withoutEnd}ы", "#{withoutEnd}е", "#{withoutEnd}у", "#{withoutEnd}ой", "#{withoutEnd}е"]

  # todo add more exceptions here
  result = name: cases[0], found: cases[0].toLowerCase() in ruFemNames, cases: cases, src: name

  result.possible_yes = result.found || endOfWord in validEndOfWord
  caseIndex = cases.indexOf name
  result.guess_case_index = caseIndex
  result.guess_case = if -1 == caseIndex then "unknown" else ["nominative","genitive","dative","accusative","instrumental","prepositional"][caseIndex]
  result


# lastename = (str) ->
#   ruRe = /^[а-я ]$/i
#   sex = null
#   # try to gess sex
#   inclined = yes

